import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class About extends StatelessWidget {
  const About({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(),
      body: SingleChildScrollView(
        child: Directionality(
          textDirection: TextDirection.rtl,
          child: Padding(
            padding: const EdgeInsets.all(8.0),
            child: Column(
              children: [
                Text('''
              مرحبًا بك في   زين التنموية 
 تصف شروط الاستخدام هذه الشروط والأحكام المطبقة على وصولك واستخدامك لمواقع الويب ومواقع الهاتف المحمول والبوابات الأخرى التي تمتلكها زين التنموية  أو توفرها من وقت لآخر والتي تتعلق بمنصة التجارة الإلكترونية زين التنموية    بما في ذلك على سبيل المثال لا الحصر الويب والإصدارات المحسّنة للجوّال لمواقع الويب وتطبيقات الأجهزة المحمولة لمنصة التجارة 
الإلكترونية   (" مواقع "). هذا المستند هو اتفاقية ملزمة قانونًا بينك كمستخدم (مستخدمين) للمواقع (يشار إليها باسم " أنت " أو " الخاص بك " أو " المستخدم " فيما يلي) والكيان المتعاقد مع  (يشار إليها باسم " نحن " أو "لدينا" أو " ahlanwashlan.com " فيما يلي).
المادة 1: -التعريفات
يكون للمصطلحات التالية حسبما يتم استخدامها في هذا الاتفاق (طبقا لما هو معرف هنا) المعاني المبينة أدناه:
1-"مستخدم مصرح له" تعني أي فرد مصرح له باستخدام خدمات زين التنموية 
2-"البيانات الشخصية" تعني أي معلومات فيما يتصل بهذا الاتفاق والتي يمكن استخدامها بشكل معقول لتحديد هوية أي فرد أو بخلاف ذلك المعلومات التي تعتبر بيانات شخصية بموجب قانون حماية البيانات.
3-"رسم الخدمة" يعني رسوم الخدمة المطبقة على رسوم محاسبة المستخدمين لخدمات زين التنموية  – إن وجدت.
4- يعني   المحمول أو على الموقع الإلكتروني للهاتف المحمول اللازم لاستخدام خدمة  ، حسبما يتم تحديثه من وقت لآخر من جانب  .
5-"خدمة  " يعني خدمة تقنية  التي تمكن المستخدمين والمسئولين عند استخدامها مع  أو لوحة التحكم من ممارسة انشطتهم التجارية عبر موقعنا.
6-"رسوم محاسبة المستخدم" تعني الرسوم التي يكبدها المستخدمون المصرح لهم والتي يتم الحصول عليها باستخدام خدمة a بما في ذلك أي تعريفات ورسوم وضرائب أي رسوم أخرى أو مصروفات التي قد تستحق لأجل أي استخدام بعينه لخدمة  المصطلحات.
7-"حساب  يقصد به حساب   الذي قام فيه مالك الحساب بما يلي:
(1) تحميل  على جهاز محمول مناسب،
(2) تسجيل حساب مستخدم شخصي مفعل على خدمة  والاحتفاظ به في الوقت الحالي، الأمر الذي يتطلب إدخال بعض معلومات التعريف الشخصية،
 (3) تأكيد رقم الهاتف المحمول المقدم أثناء عملية التسجيل.
المادة 2: -تطبيق وقبول الشروط
1-وصولك إلى المواقع والبرامج والمنتجات الخاصة بـ  واستخدامها من خلال المواقع، والتي تشمل الشروط والأحكام الواردة في هذا المستند بالإضافة إلى الخصوصية، وأي قواعد وسياسات أخرى للمواقع التي قد تنشرها  من وقت لآخر.
يشار إلى هذا المستند والقواعد والسياسات الأخرى الخاصة بالمواقع مجتمعة أدناه باسم " الشروط ". من خلال الوصول إلى المواقع واستخدامها، فإنك توافق على قبول الشروط والالتزام بها.
يرجى عدم الوصول إلى الخدمات أو المواقع أو استخدامها إذا كنت لا تقبل جميع الشروط. 
2-لا يجوز لك الوصول إلى المواقع أو استخدامها ولا يجوز لك قبول الشروط إذا
(أ) لم تبلغ السن القانوني لتكوين عقد ملزم مع  ،
(ب) لا يُسمح لك بموجب قوانين المملكة العربية السعودية.
1.3 يجوز لشركة  تعديل أي شروط في أي وقت عن طريق نشر الشروط المعدلة والمعاد صياغتها ذات الصلة على المواقع. من خلال الاستمرار في الوصول المواقع أو استخدامها، فإنك توافق على أن الشروط المعدلة والمعاد صياغتها ستنطبق عليك. 
1,4 لا يجوز تعديل الشروط بخلاف ذلك إلا كتابةً بواسطة مسؤول معتمد من 
المادة 3: -العلاقة التعاقدية
تشكل شروط الخدمة الحالية اتفاقية ملزمة من الناحية القانونية (والتي يشار إليها فيما بعد باسم "الاتفاقية") بينك وبين  المملوك لشركة اهلا وسهلا
تحكم هذه الاتفاقية استخدامك ل  ، والموقع الالكتروني، ومركز الاتصال، والمنصة التكنولوجية (والذين يشار إليهم مجتمعين باسم " "). يكون الحق في تشغيل  مرخص من جانب شركة اهلا وسهلا والتي توفر إليك الحق في استخدام
يرجى قراءة هذه الاتفاقية بعناية قبل الوصول إلى أو استخدامها. وإذا كنت لا توافق على الالتزام بشروط هذه الاتفاقية وأحكامها، فلا يجوز لك الوصول إلى  
يُشكل وصولك إلى   واستخدامك لها موافقة منك على الالتزام بهذه الاتفاقية، مما ينشئ علاقة تعاقدية بينك وبين شركة اهلا وسهلا ويحق لشركة اهلا وسهلا إنهاء هذه الاتفاقية التي تخصك بأثر فوري، أو بشكل عام إيقاف عرض خدمات   أو منع الوصول إليها أو إلى أي جزء منها، في أي وقت ولأي سبب كان دون إشعار مسبق.
وقد تُطبَّق بعض الشروط التكميلية على خدمات معينة، مثل السياسات الخاصة بحدث ما أو بحملة ترويجية معينة، وسيُفصَح لك عن هذه الشروط التكميلية فيما يتعلق بالخدمات المقدَّمة أو السياسة الخاصة بالتاجر أو الشاحن مقدم الخدمة وسياساته الخاصة.
تضاف الشروط الإضافية إلى هذه الاتفاقية لأغراض الخدمات المقدمة وتُعد جزءًا لا يتجزأ منها. وتسري الشروط الإضافية على هذه الاتفاقية في حالة وجود تعارض فيما يتعلق بالخدمات المقدمة.
يجوز لـشركة. اهلا وسهلا تعديل هذه الاتفاقية من حين لآخر. وتسري التعديلات عقب نشر شركة. اهلا وسهلا للاتفاقية المحدثة على هذا الموقع أو نشر السياسات المعدلة أو الشروط التكميلية المتعلقة بالخدمة المقدمة.
ويُشكل استمرار وصولك ل  أو استخدامك لها بعد هذا النشر موافقة منك على الالتزام بهذه الاتفاقية، بصيغتها المعدلة.
يكون جَمْعِنا للمعلومات الشخصية فيما يتعلق ب  واستخدامنا لها وفقًا لما هو منصوص عليه في سياسة الخصوصية الخاصة بشركة اهلا وسهلا، والتي يمكن الاطلاع عليها من خلال زيارة سياسة الخصوصية.
ويجوز لشركة اهلا وسهلا تقديم ما يلزم من المعلومات (بما في ذلك معلومات الاتصال الخاصة بك) إلى السلطات القضائية في حال وجود شكوى أو نزاع أو خلاف، والذي قد يتضمن حادثًا يقع بينك وبين مقدم خدمات خارجي حيث تكون هذه المعلومات أو البيانات ضرورية لتسوية الشكوى أو النزاع أو الخلاف.
 
المادة 4: -. تقديم الخدمات
يجب عليك التسجيل كعضو في المواقع من أجل الوصول إلى بعض الخدمات المتاحة عبر الموقع واستخدامها. علاوة على ذلك، تحتفظ  بالحق، دون إشعار مسبق، في تقييد الوصول إلى خدمات معينة أو استخدامها.
يجوز لشركة  إطلاق أو تغيير أو ترقية أو فرض شروط أو تعليق أو إيقاف أي خدمات (أو أي ميزات داخل الخدمات) دون إشعار مسبق باستثناء أنه في حالة الخدمة الخاضعة للرسوم، لن تؤثر هذه التغييرات سلبًا بشكل كبير قدرة هؤلاء المستخدمين الذين يدفعون الثمن على الاستمتاع بهذه الخدمة.
قد يتم توفير بعض الخدمات (أو جزء منها) بواسطة الشركات التابعة لـ  نيابة عن  .
 
المادة 5: -. الباقات المتاحة عبر الموقع
تمنحك   الباقات الأتية: -
3,1 -الباقة المجانية من خلال الباقة المجانية تجريبي ثلاثين يوم تستطيع رفع خمسة منتجات على متجرك. غير شامل الحملات التسويقية.
3,2-الباقة الأساسية: -وتتيح لك الاتي: -
معلومات كاملة عن الشركة تاريخها النبذة مقاطع فيديو وصور وعلاماتها التجارية مقاطع فيديو وصور عن المنتجات توفر كامل بيانات العميل احصائيات وتحليل زوار ملف الشركة والمنتجات تحليل الصلات المتروكة تحليل الشحن والتوصيل دردشة WhatsApp مع المشترين مدير حساب حملات تسويقية عبر وسائل التواصل وقوقل والمواقع مستشار تسويقي استقبال عروض من نفس فئة المنتج عرض كميات وصفقات خيارات الدفع رفع منتجات غير محدودةمده الباقة 356 يوم
تكلفة الباقة 1200 ريال سعودي.
 
المادة 6: -المستخدمون بشكل عام
6,1 كشرط لوصولك إلى المواقع واستخدامها، فإنك توافق على أنك ستمتثل لجميع القوانين واللوائح المعمول بها في المملكة العربية السعودية
6,2 أنت توافق على: -
أنك لن تقوم بنسخ أو إعادة إنتاج أو تنزيل أو إعادة نشر أو بيع أو توزيع أو إعادة بيع أي خدمات أو أي معلومات أو نصوص أو صور أو رسومات أو مقاطع فيديو أو صوت أو أدلة أو ملفات أو قواعد بيانات أو قوائم، إلخ على المواقع أو من خلالها (" محتوى الموقع ")، و
لن تقوم بنسخ أو إعادة إنتاج أو تنزيل أو تجميع أو استخدام أي محتوى موقع لأغراض تشغيل شركة تتنافس مع ahlanwashlan.com، أو خلاف ذلك استغلال محتوى الموقع تجاريًا.
يُحظر الاسترداد المنهجي لمحتوى الموقع من المواقع لإنشاء أو تجميع، بشكل مباشر أو غير مباشر، مجموعة أو تجميع أو قاعدة بيانات أو دليل (سواء من خلال الروبوتات أو الأجهزة الآلية أو العمليات اليدوية أو خلافه) دون إذن كتابي من ahlanwashlan.com.
يُحظر استخدام أي محتوى أو مواد على المواقع لأي غرض غير مسموح به صراحةً في الشروط. 
6,3 لمعرفة كيفية استخدامنا نحن والشركات التابعة لنا لمعلوماتك الشخصية وحمايتها عند استخدام الموقع ذي الصلة، يرجى مراجعة سياسة الخصوصية الخاصة بنا على الرابط التالي: ahlanwashlan.com. 
6,4 أنت توافق على عدم اتخاذ أي إجراء لتقويض سلامة أنظمة الكمبيوتر أو شبكات ahlanwashlan.com.sa و / أو أي مستخدم آخر ولا للحصول على وصول غير مصرح به إلى أنظمة الكمبيوتر أو الشبكات هذه.
6,5 توافق على عدم اتخاذ أي إجراء قد يقوض سلامة نظام التعليقات في ahlanwashlan.com.sa، مثل ترك تعليقات إيجابية لنفسك باستخدام معرفات أعضاء ثانوية أو من خلال جهات خارجية أو عن طريق ترك تعليقات سلبية غير مؤكدة لمستخدم آخر.
6,6 من خلال نشر أو عرض أي شعارات وعلامات تجارية وعلامات خدمة وعلامات تجارية ووصف / معلومات في قوائم المنتجات وأي معلومات أو محتوى أو مادة أخرى على المواقع (أي من هذه المعلومات أو المحتوى أو المواد ، يشار إليها مجتمعة باسم " المستخدم المحتوى ") أو تقديم أي محتوى مستخدم إلى ahlanwashlan.com و / أو الشركات التابعة لها وممثليهم (ممثليهم) ، وإلى الحد الذي تسمح به القوانين المعمول بها ، فإنك تمنح حقًا غير قابل للإلغاء ودائم وعالمي وخالي من حقوق الملكية وفرعي ترخيص مرخص (من خلال مستويات متعددة) لشركة ahlanwashlan.com.saو / أو الشركات التابعة لها وممثليهم (ممثليهم) لعرض ونقل وتوزيع وإعادة إنتاج ونشر وتكرار وتكييف وتعديل وتحرير وترجمة وإنشاء أعمال مشتقة باستخدام المستخدم المحتوى ، قم بإزالة أي جزء منه (بما في ذلك ، على سبيل المثال لا الحصر ، العلامة المائية أو علامة تحمل محتوى المستخدم) ،  بشكل مباشر أو غير مباشر ، لـ ahlanwashlan.com ، وتشغيل المواقع ، وتوفير أي خدمات وخدمات ترويجية و / أو أعمال المستخدم. أنت تؤكد وتضمن لـ ahlanwashlan.com أن لديك جميع الحقوق والصلاحيات والسلطات اللازمة لمنح الترخيص أعلاه ومحتوى المستخدم واستخدام محتوى المستخدم هذا (بما في ذلك الأعمال المشتقة) بواسطة ahlanwashlan.com و / أو الشركات التابعة لها بموجب هذا الترخيص خالٍ من أي انتهاك أو انتهاك لأي من حقوق الطرف الثالث. إلى أقصى حد يسمح به القانون، تتنازل عن حقك في إنفاذ حقوق الملكية الفكرية الخاصة بك في محتوى المستخدم ضد ahlanwashlan.com و / أو الشركات التابعة لها أو المتنازل لهم أو المرخص لهم من الباطن فيما يتعلق باستخدام محتوى المستخدم هذا فيما يتعلق بالخدمات. لن يتم استخدام المعلومات المحمية بموجب قوانين حماية البيانات والاحتفاظ بها إلا وفقًا لتلك القوانين.
المادة 7: -الإرشادات السارية على الجميع: -
يتعين على كل مستخدم ينشئ حساباً في ahlanwashlan.com الالتزام بالإرشادات الأتية: -
7,1-معاملة الجميع باحترام:
يتميز مجتمع ahlanwashlan.com بتنوعه الكبير، ويمكن أن تصادف في بعض الأحيان أشخاصاً قد يختلفون عنك وعن معتقداتك. تساعد الإرشادات الواردة في هذا القسم على دعم التعاملات الإيجابية في مجتمعنا المتنوع طوال الوقت.
7,2: -المساهمة في الحفاظ على سلامة الجميع: -
يبذل فريق العمل قصارى جهده للمساعدة على توفير تجارب آمنة للجميع كل يوم. صممنا هذه المعايير، لأن سلامتكم على رأس أولوياتنا.
7,3-الالتزام بالقوانين: -
 نحن ملتزمون باتباع جميع القوانين السارية وكسب ثقتك، ونرجو من جميع مستخدمي الموقع تأدية دورهم والالتزام بالقوانين واللوائح السارية.
7,4-تعليقاتك تهمنا:
نبذل قصارى جهدنا لتسهيل وسائل الاتصال حتى تتمكن من إبلاغنا مباشرة من خلال ahlanwashlan.com بأي شيء تواجهه سواء كنت تجده جيداً أو سيئاً. يعمل فريقنا باستمرار على تطوير معاييرنا وسياساتنا، ولذلك تُعدّ تعليقاتك مهمة لنتمكن من اتخاذ الإجراءات المناسبة والحفاظ على حداثة معاييرنا بتطور التكنولوجيا في ahlanwashlan.com.
7,5-معاملة الجميع باحترام
تعامل مع الجميع في مُجتمع ahlanwashlan.com بالطريقة نفسها التي ترغب في أن يتعاملوا معك بها: ألا وهي الاحترام. فقد تُصبح الأفعال التي تقوم بها أثناء استخدام ahlanwashlan.com ذات أثر كبير على سلامة الآخرين وراحتهم.
وتُعدّ اللباقة أمراً مهماً. لهذا نتوقَّع منك التحلي بالحكمة والتصرف بلباقة مع الآخرين أثناء استخدام ahlanwashlan.com وأثناء التعامل مع الآخرين في مُجتمع الموقع، تماماً بالطريقة التي تتصرف بها في أي مكان عام.
والأهم من ذلك، تذكر دائماً أنك عند استخدامك ahlanwashlan.com فإنك ستقابل أشخاصاً يختلفون عنك أو يفكرون بشكل مختلف عنك. يرجى احترام تلك الاختلافات. إننا نؤمن بضرورة أن يشعر الجميع بالدعم والترحيب عند التعامل مع الآخرين في مُجتمع ahlanwashlan.com.
لهذا السبب وضعنا معايير متعلقة بالتلامس الجسدي، والمساحة الشخصية والخصوصية، والتهديد والسلوك الفظ، وممارسة التمييز، والإضرار بالممتلكات.
7,6-التلامس الجسدي: -
لا تلمس الغرباء أو أي شخص تقابله أثناء استخدام ahlanwashlan.com. لا يُسمح مُطلقاً بإيذاء أي شخص أو الشروع في إيذائه.
7,7: -المساحة الشخصية والخصوصية
المساحة الشخصية والخصوصية مسألتان مهمتان لنا جميعاً. يمكنك أن تتبادل أطراف الحديث مع الآخرين. ولكن يرجى عدم إبداء تعليق يخُص مظهر شخص ما أو سؤاله عن حالته الاجتماعية.
يجب احترام خصوصية الآخرين ومساحتهم الشخصية. تستعرض القائمة التالية أمثلةً على السلوك غير اللائق، ولكنها ليست شاملة.
لا تطرح أسئلة شخصية (مثل أسئلة الحالة الاجتماعية)
لا تعلِّق على المظهر (مثل إبداء التعليقات المهينة أو "المُجامِلة")
لا للتعليقات أو الإيماءات المسيئة (مثل الإهانات أو التعليقات التي يكون فيها تحرش أو إيحاءات جنسية)
لا تغازل (بما فيها المغازلة غير اللفظية أو الإيحائية، ولا تقترب كثيراً من الآخرين)
لا تعرض مواد غير لائقة (مثل العناصر والصور الاستفزازية)
 
7,8: -التهديد والسلوك الفظ"-
لا يُسمح بالسلوك العدواني، أو التصادمي، أو التحرش. لا تستخدم لغة أو إيحاءات أو تقوم بتصرفات مشينة أو تهديدية أو غير لائقة. على سبيل المثال، لا تشارك الصور الإيحائية مع الآخرين في مجتمع ahlanwashlan.com (مثل الصور الجنسية الصريحة أو التي تصور العنف الجسدي)، ويتضمن ذلك المشاركة غير المرغوب فيها لمثل هذه الصور من خلال أنظمة الدعم في ahlanwashlan.com على الإنترنت، أو في أي ما يتعلق بخدمات ahlanwashlan.com. كما يُفضَّل عدم تناول أي موضوعات شخصية قد تكون مُسبِّبة للخلاف في طبيعتها، مثل الدين والانتماءات السياسية.
7,9-الإضرار بالممتلكات: -
لا يُسمح مطلقاً بالإضرار بالممتلكات الخاصة بالتاجر. وتتضمن الأمثلة والكسر أو التخريب، أو سكب الطعام أو الشراب عمداً، أو غير ذلك. ستقع عليك مسؤولية تحمل تكاليف التنظيف والإصلاح إذا أتلفتَ أي ممتلكات.
7,10-المساهمة في الحفاظ على سلامة الجميع: -
لكل شخص دور مُحدَّد في المساهمة في خلق بيئة آمنة. ولذلك، وضعنا معايير حول مشاركة الحساب، والحد الأدنى لعمر صاحب الحساب، وغير ذلك.
7,11-مشاركة الحساب: -
لا يُسمح بمشاركة الحساب. يجب عليك التسجيل والحفاظ على حسابك الخاص مفعلاً. لا تسمح لأي شخص آخر باستخدام حسابك، ولا تشارك معلوماتك الشخصية المُستخدمة في حسابك مع أي شخص آخر للدخول إلى ahlanwashlan.com، بما في ذلك على سبيل المثال لا الحصر اسم المستخدم أو كلمة المرور أو صورك.   
7,12: -حالات الطوارئ العامة: -
يجوز ل ahlanwashlan.com اتخاذ تدابير إضافية للحفاظ على سلامة مستخدمي تطبيقنا في حالات الطوارئ العامة، بما فيها على سبيل المثال لا الحصر، الكوارث الطبيعية وحالات الطوارئ الصحية والأزمات العامة.
على سبيل المثال، إذا علم ahlanwashlan.com من هيئة الصحة العامة بأن شخصاً يستخدم الموق عقد يتسبب في أي ضرر عام، فإنه يجوز لنا إيقاف حساب الشخص مؤقتاً إلى أن يصبح آمناً السماح له باستخدام ahlanwashlan.com مجدداً. وعلى نحو مماثل، فإننا قد نوقف السماح لأشخاص في مدينة بأكملها أو منطقة باستخدام جزء من خدمات تطبيقنا أو كلها، امتثالاً لإرشادات السلطات في حالات الطوارئ المتعلقة بالصحة العامة والكوارث الطبيعية وغيرها من الأزمات العامة، أو عندما يمكن أن يؤدي توفر استخدام ahlanwashlan.com إلى أي خطر واضح.
7,13-الالتزام بالقوانين: -
وضعنا المعايير استناداً إلى القوانين والأنظمة السارية ويتعين على المستخدمين اتِّباعها. على سبيل المثال، يُحظر تماماً استخدام ahlanwashlan.com لارتكاب أي جريمة، أو انتهاك أي قوانين أو لوائح أخرى.
7,14-حظر الأسلحة النارية: -
يُحظر على الزبون، حمل أسلحة نارية من أي نوع عند استخدام ahlanwashlan.com، وذلك بالقدر الذي يسمح به القانون المعمول به.
7,15-الاحتيال: -
يمكن أن يؤدي الخداع إلى زعزعة الثقة وقد يكون له تأثير خطير. لا يُسمح بتزوير المعلومات عن قصد أو انتحال هوية شخص آخر (أو السماح لشخص آخر بالاحتفاظ بهويتك)، على سبيل المثال عند تسجيل الدخول أو الخضوع لفحص أمني. ويجب تقديم معلومات دقيقة عند الإبلاغ عن الحوادث، وإنشاء حسابات ahlanwashlan.com والدخول إليها، وعند إرسال شكاوى بشأن الرسوم المفروضة أو التكلفة المطلوبة.
7,16-تعليقاتك تهمنا: -
نبذل قصارى جهدنا لتسهيل وسائل الاتصال حتى تتمكن من إبلاغنا بأي شيء تواجهه سواء كنت تجده جيداً أو سيئاً. يطوّر فريقنا دائماً معاييرنا، وتُعدّ تعليقاتك مهمة لجعل معاييرنا مرتبطة بالتطور التكنولوجي. يرجى تقييم تجربتك في نهاية كل مشوار.
حيث تساعدنا تعليقاتك البناءة على ضمان تحمُّل كل شخص مسؤولية سلوكه. ويساعد تحمُّل المسؤولية على توفير بيئة تتسم بالاحترام والأمان.
 أما في حالات الطوارئ أو إذا كنت تواجه خطراً مباشراً، فأبلغ السلطات المحلية أو خدمات حالات الطوارئ قبل إبلاغ ahlanwashlan.com بالحادث.
المادة 8 – أهلية التاجر القانونية: 
 
 يجب أن تتوافر الأهلية القانونية والنظامية والشرعية اللازمة للقيام بأعمال التجارة عبر منصة ahlanwashlan.com الالكترونية.
2. في حال مخالفة التاجر لهذه المادة ” أهلية التاجر القانونية ” فإنه يتحمّل تبعات هذه المخالفة أمام المستهلكين أو المستخدمين أو الغير، حيث أن منصة ahlanwashlan.com  لا علاقة لها بتعاملات التاجر مع المستهلك أو الغير من الناحية القانونية والنظامية والشرعية، كما أنه يحق لمنصة ahlanwashlan.com  في هذه الحالة مساءلة التاجر بموجب أحكام المسئولية العقدية، ومطالبته بالتعويض عن الأضرار التي قد تنشأ نتيجة هذه المخالفة، ومن قبيل هذه الأضرار ما يصيب منصة ahlanwashlan.com  في سمعتها أمام التجار الآخرين أو المستهلكين أو المستخدمين أو أمام الغير.
المادة 9 – طبيعة التزام منصة ahlanwashlan.com: -
إن مهمة منصة ahlanwashlan.com هي مجرد تقديم أدوات الدعم الالكتروني، عن طريق تأسيس المتجر، حيث أن التزام منصة ahlanwashlan.com بموجب هذه الاتفاقية هو فقط انشاء المتجر الالكتروني الخاص بالتاجر لدى منصة ahlanwashlan.com الالكترونية، ووضع المتجر أمام المستخدمين.
قد توفّر منصة ahlanwashlan.com خدمات أخرى للتاجر أو المتجر كخدمات الدعم التسويقي أو خدمات التوجيه والإرشاد، وكذلك قد توفّر له بوابات دفع الكترونية عبر الانترنت، وجميع خدمات منصة ahlanwashlan.com تخضع لمواد وبنود وأحكام اتفاقية الاستخدام هذه.
لا تلتزم منصة ahlanwashlan.com بإتمام عمليات بيع المنتجات أو الخدمات بين المستهلك والمتجر، حيث أن التزامها ينتهي بتقديم خدمات إنشاء المتجر الالكتروني عبر منصة ahlanwashlan.com، ولا يضر ذلك بالخدمات الأخرى التي تستمر منصة ahlanwashlan.com بتقديمها كخدمات التوجيه والإرشاد والدعم الفني والتسويق ووسائل الدفع.
إن منصة ahlanwashlan.com قدّ توفّر وبشكل مؤقت بعض الخدمات المجانية لبعض المتاجر، مثل أن يقوم التاجر بـ: تعديل وتغيير مظهر أو شكل أو ألوان المتجر بناء على رغبته، وتُقدّم هذه الخدمات من قبل إدارة منصة ahlanwashlan.com بشكل مجاني ومحدود وتخضع لقيود محددة ومعيّنة فإن رغب التاجر بخدمات إضافية عليه أن يتواصل مع الدعم الفني الخاص بمنصة ahlanwashlan.com للاستفسار عن العروض ورسوم الباقات والخدمات الإضافية.
إن جميع التعاملات التي تتم بين التاجر والمستهلك لا علاقة لها بشخص منصة ahlanwashlan.com، ومنصة ahlanwashlan.com غير مسئولة عنها، حيث أن هذا التعامل هو علاقة تعاقدية مستقلة تخضع للاتفاق الذي يبرم بين التاجر والمستهلك. وبناءً عليه فإذا تخلّف المستهلك عن سداد ثمن الخدمة أو المنتج الذي يوفّره التاجر فلا علاقة لمنصة ahlanwashlan.com بهذه المخالفات.
إن جميع التعاملات التي تتم بين التاجر ومزودي الخدمات ( خدمات الطرف الثالث ) الذين توفر منصة ahlanwashlan.com  الربط مع خدماتهم أو عرض خدماتهم ليستفيد منها التاجر والمستهلك لا علاقة لها بمنصة ahlanwashlan.com  ، حيث أن هذا التعامل هو علاقة تعاقدية مستقلة عن منصة ahlanwashlan.com  وخاضعة للاتفاق المبرم بين التاجر ومزود الخدمة ، وبناءً عليه فإذا تخلّف أو امتنع أو لم يلتزم أحد الاطراف في تنفيذ التزاماته التي جرى الاتفاق عليها أو لم ينفذها على الوجه المطلوب فإن منصة ahlanwashlan.com  غير مسئولة عن ما ينتج عن هذه التصرفات، إن منصة ahlanwashlan.com  غير مسئولة عن أي مخالفات تحدث أو يتم ارتكابها بين التاجر ومزود الخدمة.
أنت تعلم أن منصة ahlanwashlan.com تعتبر منصة إلكترونية تقنية على شبكة الانترنت تتيح للتاجر الذي يوافق على هذه الاتفاقية تأسيس متجره الالكتروني، وممارسة نشاطه عبر المتجر، ومهمتها تنتهي عند هذا الحد. فليس هناك أدنى مسئولية على منصة ahlanwashlan.com حول المخالفات التي يقوم بها التاجر في متجره بالمخالفة لأحكام هذه الاتفاقية، وليس لمنصة ahlanwashlan.com أي علاقة بالنسبة للتعاملات التي تتم بين التاجر والمستهلك.
 
المادة 10 – ضوابط إنشاء المتجر الالكتروني: 
يجوز لكل شخص توافرت فيه الأهلية القانونية المعتبرة نظاماً وشرعاً إنشاء متجره وفقاً لقواعد وأحكام اتفاقية الاستخدام.
يجب أن يكون المتجر الذي تم تأسيسه وفقاً لاتفاقية استخدام منصة ahlanwashlan.com  غير مخالف للأنظمة والقوانين في المملكة العربية السعودية، ويلتزم التاجر بتوضيح ماهية الأعمال التي يقوم بالتجارة الالكترونية عن طريقها، وماهية الخدمات أو المنتجات التي يقدّمها أو يبيعها، وتخلي منصة ahlanwashlan.com  مسئوليتها عن مخالفة المتجر لأحكام النظام السعودي في المملكة العربية السعودية والآداب العامة، و يبقى لمنصة ahlanwashlan.com  دائماً الحق في رفض تسجيل أي متجر الكتروني لا يتوافق مع القوانين والأنظمة المرعية في المملكة العربية السعودية أو أحكام هذه الاتفاقية، وعليه فإن التاجر يقر بموجب أحكام الاتفاقية أن متجره لا يخالف النظام العام في المملكة العربية السعودية أو الآداب الإسلامية.
يجب أن يكون المتجر الذي تم تأسيسه عن طريق منصة ahlanwashlan.com غير مخالف لقواعد وأحكام اتفاقية الاستخدام هذه، كما يقر التاجر بأن المحل الذي ينصب عليه التعامل في المتجر غير مخالف لهذه الاتفاقية وغير مخالف للأنظمة والقوانين المعمول بها في المملكة العربية السعودية.
لا يحق لأي شخص استخدام منصة ahlanwashlan.com إذا ألغيت عضويته أو متجره من قبل منصة ahlanwashlan.com أو بموجب أوامر أو أحكام قضائية.
في حال قيام أي مستخدم بالتسجيل كمؤسسة أو شركة، أو مؤسسة خيرية أو جهة اعتبارية، فإن المؤسسة أو الشركة أو الجهة المسجّلة تكون ملزمة بكافة القواعد والأحكام المذكورة في اتفاقية الاستخدام الخاصة بمنصة ahlanwashlan.com.
ينبغي على كافة المتاجر والتُجّار الالتزام بكافة القوانين المعمول بها لتنظيم التجارة عبر الانترنت وكذلك الالتزام بنظام الجرائم المعلوماتية وأنظمة وزارة التجارة والاستثمار ونظام التعاملات الالكترونية ونظام التجارة الالكترونية.
يقر التاجر بأنه قبل تسجيله في منصة ahlanwashlan.com الالكترونية قد تحقق من توافر جميع الإجراءات والاشتراطات المطلوبة من قبل الجهات الرسمية في المملكة العربية السعودية وقد استوفى جميع هذه الإجراءات والاشتراطات لممارسة نشاطه في المتجر.
ينبغي على كافة المتاجر الراغبة بالتسجيل بمنصة ahlanwashlan.com ومزاولة نشاط التجارة الإلكترونية بالمنصة أن يكون لديها سجل تجاري قائم أو وثيقة عمل حر.
في حالة كان التاجر المتقدّم لطلب الانضمام وتأسيس المتجر عبارة عن تاجر فرد “شخص طبيعي”، فيلتزم كذلك بالتحقق من الاشتراطات المطلوبة لدى الجهات الرسمية وتوفيرها بحسب طبيعة نشاط الفرد التاجر، حيث أن التاجر الفرد يقر بأنه ملتزم بهذه الاشتراطات وملتزم بتوفيرها وتجهيزها، كما يلتزم التاجر الفرد بتوفير رقم هويته الوطنية وغير ذلك من المعلومات اللازمة والوثائق التي تطلبها منصة ahlanwashlan.com.
في حالة كان التاجر المتقدم لطلب الانضمام وتأسيس متجره يمثل مؤسسة تجارية أو شركة أو مؤسسة خيرية أو جهة اعتبارية فلابُد من تزويد منصة ahlanwashlan.com بكافة المعلومات والوثائق الثبوتية، مثل السجل التجاري وأي وثائق أخرى للمتجر تطلبها منصة ahlanwashlan.com للتسجيل ولإثبات الشخصية القانونية الخاصة بالمتجر.
يجب أن يلتزم المتجر والتاجر بالتزامات التسجيل المحددة في ” المادة الخامسة – الحسابات والتزامات التسجيل “، وجميع قواعد وأحكام اتفاقية الاستخدام.
المادة 11 – الحسابات والتزامات التسجيل: 
فور التقدم بطلب الانضمام إلى عضوية منصة ahlanwashlan.com أو طلب إنشاء المتجر الالكتروني تكون مطالباً بالإفصاح عن معلومات محددة واختيار اسم مستخدم وكلمة مرور سرية لاستعمالها عند الولوج لخدمات منصة ahlanwashlan.com. وبعد تنشيط حسابك سوف تصبح مستخدمًا لخدمات منصة ahlanwashlan.com، وبذلك تكون قد وافقت على:
أن تكون مسؤولاً عن المحافظة على سرية معلومات حسابك وسرية كلمة المرور، وتكون بذلك موافقاً على إعلام منصة ahlanwashlan.com حالاً بأي استخدام غير مفوض به لمعلومات حسابك لدى منصة ahlanwashlan.com أو أي اختراق آخر لمعلوماتك السرية. 
لن تكون منصة ahlanwashlan.com بأي حال من الأحوال مسؤولًة عن أي خسارة قد تلحق بك بشكل مباشر أو غير مباشر معنوية أو مادية نتيجة كشف معلومات اسم المستخدم أو كلمة الدخول أو في حال إساءة استخدام المتجر.
أنت تلتزم باستخدام متجرك الالكتروني بنفسك، حيث أنك مسؤولاً عنه مسؤولية كاملة، وفي حال استخدام غيرك له فهذه يعني أنك قد فوّضته باستخدام المتجر باسمك ولحسابك مالم يقوم المتجر بإبلاغ إدارة ahlanwashlan.com بعكس ذلك.
أنت تلتزم عند استخدام منصة ahlanwashlan.com  أن تستخدمها بكل جدية ومصداقية، وأن تلتزم بقواعد وأحكام اتفاقية الاستخدام وأن تلتزم بالضوابط النظامية والقانونية المعمول بها في المملكة العربية السعودية، وتعتبر ملزماً بتعويض منصة ahlanwashlan.com  عن أي خسائر مباشرة أو غير مباشرة قد تلحق بمنصة ahlanwashlan.com  نتيجة أي استخدام غير شرعي أو غير حقيقي أو غير مفوض لحسابك من طرفك أو من طرف أي شخص آخر حصل على مفاتيح الولوج إلى حسابك بالمنصة سواء كان لإنجاز الخدمات باستعمال اسم المستخدم وكلمة المرور أو نتيجة لإهمالك المحافظة على سرية اسم المستخدم وكلمة المرور ، وسواء بتفويض منك أو بلا تفويض.
أنت تلتزم بالإفصاح عن معلومات حقيقية وصحيحة ومحدثة وكاملة وقانونية عن نفسك حسبما هو مطلوب أثناء التسجيل لدى منصة ahlanwashlan.com وتلتزم بتحديث بياناتك في حال تغييرها في الواقع أو في حال الحاجة إلى ذلك.
ألا تدرج ضمن اسم المستخدم أي من تفاصيل الاتصال بك كعناوين البريد الإلكتروني أو أرقام هواتفك أو أي تفاصيل شخصية، أو أي عبارة تُشير إلى علاقة شخصية أو تجارية بينك وبين منصة ahlanwashlan.com أو منسوبيها أو مُلّاكها.
ألا تضع ما يشير في متجرك إلى أي علاقة مباشرة أو غير مباشرة بين المتجر ومنصة ahlanwashlan.com أو إدارتها أو مُلّاكها أو منسوبيها، حيث أن منصة ahlanwashlan.com لا علاقة لها بما تقوم به في متجرك وهي غير مسئولة عن نشاط متجرك.
إن منصة ahlanwashlan.com تلتزم بالتعامل مع معلوماتك الشخصية وعناوين الاتصال بك بسريّة وفقاً لأحكام سياسة الخصوصية وسرية المعلومات المعمول بها لدى منصة ahlanwashlan.com.
سوف تكون ملزمًا بالحفاظ على بيانات التسجيل وتحديثها دائمًا للإبقاء عليها حقيقية وصحيحة وراهنة وكاملة وقانونية، وإذا أفصحت عن معلومات غير حقيقية أو غير صحيحة أو غير راهنة أو غير كاملة أو غير قانونية او مخالفة لما جاء في اتفاقية الاستخدام، فإن منصة ahlanwashlan.com تمتلك الحق في وقف أو تجميد أو إلغاء عضويتك أو متجرك وحسابك في المنصة، وذلك دون إلحاق الأضرار بحقوق منصة ahlanwashlan.com الأخرى ووسائلها المشروعة في استرداد حقوقها وحماية باقي المستخدمين.
لمنصة ahlanwashlan.com الحق في أي وقت في أن تجري أي تحقيقات تراها ضرورية سواء كانت مباشرة أو عبر طرف ثالث وتطالبك بالإفصاح عن أي معلومات إضافية أو وثائق مهما كان حجمها لإثبات هويتك أو ملكيتك لأموالك أو للحساب الخاص بك.
في حالة عدم الالتزام بأي مما ورد أعلاه فإن لإدارة منصة ahlanwashlan.com الحق في إيقاف أو إلغاء متجرك أو عضويتك أو حجبك من الولوج لخدمات منصة ahlanwashlan.com مرة أخرى. وتحتفظ كذلك بالحق في إلغاء أي حسابات غير مؤكدة وغير مثبتة أو عمليات أو حسابات مر عليها مدة طويلة دون نشاط.
 
المادة 12 – الاتصالات الإلكترونية ووسائل التواصل الرسمية:
يوافق التاجر في منصة ahlanwashlan.com على أن يتم التواصل معه عبر البريد الإلكتروني، أو من خلال قيام إدارة منصة ahlanwashlan.com ببث رسائل عامة ترد إلى كافة المستخدمين أو إلى مستخدمين محددين حال الولوج إلى حساباتهم داخل منصة ahlanwashlan.com. كما يوافق التاجر في منصة ahlanwashlan.com على أن جميع الاتفاقيات والإعلانات والبيانات والاتصالات الأخرى التي تزود بها الكترونياً تقوم مقام مثيلاتها المكتوبة، وهي حجة قائمة بذاتها، في تلبية الاحتياجات القانونية. 
سوف تقوم منصة ahlanwashlan.com خلال فترة عضويتك وتجارتك لدى المنصة بإرسال رسائل إلكترونية ترويجية لتعريفك بأي تغيرات أو إجراءات أو نشاطات دعائية جديدة قد تضاف إلى منصة ahlanwashlan.com.
المادة 13 – التعديلات على اتفاقية الاستخدام والرسوم: 
أنت تعلم وتوافق على أن تقوم منصة ahlanwashlan.com بإعلامك عن أي تعديل على هذه الاتفاقية، وبموجبه تتضاعف التزاماتك أو تتضاءل حقوقك وفقاً لأي تعديلات قد تجري على اتفاقية الاستخدام هذه.
أنت توافق على أن منصة ahlanwashlan.com تملك بمطلق صلاحيتها ودون تحملها المسؤولية القانونية أن تجري أي تعديلات أساسية أو فرعية على هذه الاتفاقية، ويتم إعلام المستخدمين عن هذا التعديل بأي وسيلة تقنية يتم توفيرها، ويجوز أن يكون ذلك عن طريق البريد الإلكتروني أو ببث رسالة عامة لكافة المستخدمين، وتوفّر منصة ahlanwashlan.com وسائل تقنية لإظهار قبول المتجر لهذا التعديل، ويكون هذا القبول قانوني ونافي للجهالة ومُلزِم للمتجر لأحكام الاتفاقية بما فيها من تعديلات.
في حال الاعتراض على أي تعديل على اتفاقية الاستخدام فإن ذلك قد يكون عقبة أمام الولوج إلى المتجر، حيث أنه للاستفادة من خدمات منصة ahlanwashlan.com  يجب الموافقة على هذه الاتفاقية وعلى أي تعديل يطرأ عليها، ولذلك في حالة عدم قبول التعديل تأمل منكم منصة ahlanwashlan.com  التوقف عن استخدام خدماتها حيث أن مجرد ولوجكم إلى حسابكم في منصة ahlanwashlan.com  أو استخدامكم لمنصة ahlanwashlan.com  يُعد قبولًا منكم للتعديلات وموافقة كاملة تامة نافية للجهالة، وتسعد منصة ahlanwashlan.com  الإجابة على استفساراتكم بشأن هذه الاتفاقية واستقبال أي اقتراحات يراها المتجر.
كافة الرسوم تحتسب بالريال السعودي، وعلى التاجر دفع كافة الرسوم المستحقة بالمنصة مضافاً إليها أي نفقات أخرى تضيفها منصة ahlanwashlan.com، على أن يتم السداد بواسطة الوسائل المعتمدة والمحددة والمتاحة عن طريق منصة ahlanwashlan.com.
ليست كل باقات وعروض منصة ahlanwashlan.com مجانية للتُجّار أو للمتاجر حيث أن بعض هذه الباقات والعروض تخضع لرسوم متفاوتة.
قد تفرض منصة ahlanwashlan.com رسومًا على التُجّار أو المتاجر وذلك يعتمد على العروض أو الباقات التي ينضمون إليها أو البوليصيات التي يستخدمونها.
تحتفظ منصة ahlanwashlan.com بحقها في إضافة أو زيادة أو خفض أو خصم أي رسوم أو نفقات بموجب قواعد وأحكام اتفاقية الاستخدام، على أي من المستخدمين أي كان سبب تسجيلهم.
المادة 14 – خدمات الدفع والسداد للمتاجر في منصة ahlanwashlan.com: -
الدفع والسداد توفّر منصة ahlanwashlan.com عبر شركائها نظام الدفع والسداد في منصة ahlanwashlan.com فيمكن أن يتم عبر الانترنت كليا من خلال خيارات الدفع المتوفرة على منصة ahlanwashlan.com أو من خلال أي طريقة دفع توفرها منصة ahlanwashlan.com من حين لآخر.
الدفع عند الاستلام ليس هناك أي علاقة لمنصة ahlanwashlan.com، فطريقة الدفع هذه تخضع للعلاقة فيما بين مزود الخدمة والمستهلك والتاجر.
يجوز أن تشترط منصة ahlanwashlan.com في أي وقت وأي حالٍ من الأحوال أن تتم عمليات الدفع مباشرةً بين التاجر والمستهلك، وعبر حساباتهم البنكية الخاصة بهم، وليس هناك أي علاقة حينئذٍ لمنصة ahlanwashlan.com.
يلتزم التاجر بتحديد سعر الخدمة أو البضاعة التي يقوم بعرضها في متجره وفقاً للقيمة السوقية المتعارف عليها، ولا علاقة لمنصة ahlanwashlan.com بأي حال من الأحوال بسوء تقدير تكلفة المنتجات أو الخدمات المعروضة في المتاجر على منصة ahlanwashlan.com، حيث أن تقديرها بالشكل المتعارف عليه تجارياً هو التزاماً واقع على عاتق التاجر.
يلتزم التاجر بتوفير فواتير وسندات قبض وسندات استلام لجميع المبالغ والأرباح التي تنشأ في متجره، ويلتزم أن يبيّن في جميع هذه الفواتير نوع البضاعة أو الخدمة وكمياتها وأوصافها وقيمتها، وعليه فإن التاجر يلتزم بتوفير المواصفات المحاسبية المطلوبة في متجره الالكتروني، تطبيقاً لأحكام هذه الاتفاقية، ولما في هذا التنظيم من مصالح قانونية واقتصادية وتجارية للتجار، وفي حالة مخالفة التاجر لأحكام هذا البند فإنه يُعَد مسئولاً عن أي أضرار قد تنشأ نتيجة هذه المخالفة.
منصة ahlanwashlan.com لها الحق في منع استكمال إجراءات أي عملية دفع مخالفة لقواعد وأحكام اتفاقية الاستخدام أو إلغاء أي طلب شراء أو بيع نتيجة خطأ فني أو تقني في المنصة أدى إلى اختلاف الأسعار المعروضة على المنصة عن قيمة المنتج السوقية بما فيه خسارة لمنصة ahlanwashlan.com ولا تتحمل منصة ahlanwashlan.com مسئولية تلك المبالغ.
لإدارة منصة ahlanwashlan.com الحق في إلغاء أو تعديل أو تغيير أي من وسائل الدفع التي قامت بإتاحتها على منصة ahlanwashlan.com.
 إن توفير منصة ahlanwashlan.com لخدمة الدفع عبر الانترنت عن طريق المنصة هو بغرض التسهيل والمحافظة على حقوق التجار والمتاجر.
 
المادة 15 – معلوماتك الشخصية ومعلومات تفاصيل العمليات:
تخضع سرية معلومات المتاجر والتجار لقواعد “سياسة الخصوصية وسرية المعلومات” الخاصة بمنصة ahlanwashlan.com.
لا مانع لديك بأن تمنح منصة ahlanwashlan.com حقاً غير محدود، وعالمي، ودائم وغير قابل للإلغاء، ومعفي من المصاريف، ومرخص باستخدام معلومات أو مواد شخصية أو غير ذلك مما وفرتها أو زودت بها المنصة أو أعلنتها على المنصة من خلال انضمامك إليها أو تأسيسك لمتجرك، وذلك عبر النماذج المخصصة للتواصل والتسجيل، أو عبر أية رسالة إلكترونية أو أي من قنوات الاتصال المتاحة بالمنصة. وذلك بهدف تحقيق أي من المصالح التي تراها المنصة.
أنت الوحيد المسؤول عن المعلومات التي قمت بإرسالها أو نشرها وينحصر دور منصة ahlanwashlan.com بالسماح لك بعرض هذه المعلومات عن طريق منصة ahlanwashlan.com ومن خلال قنواتها الإعلانية.
 
المادة 16 – تعهد التاجر بـالالتزام بالقوانين والأنظمة في المملكة العربية السعودية:
يتعهّد التاجر بالالتزام بكافة القوانين والأنظمة المعمول بها داخل المملكة العربية السعودية حيال منتجاته أو/وأثناء استخدامه لمنصة ahlanwashlan.com، وكذا القوانين والشروط والأحكام المعمول بها والمُنظِّمة لاستخدام فضاء الإنترنت واتفاقية الاستخدام وسياسة الخصوصية وسرية المعلومات المعمول بها لدى منصة ahlanwashlan.com.
في حال مخالفة أي من التجار لما ورد في المادة العاشرة فإنه يقر بحق منصة ahlanwashlan.com في اتخاذ أي من الاجراءات التالية وهي على سبيل المثال لا الحصر: التنبيه، إيقاف الخدمة وإغلاق المتجر، إعادة أي مبالغ معلقة في المدفوعات الإلكترونية للمستهلكين.
المادة 17 – المستهلك:
تخضع سرية معلومات المتاجر والتجار لقواعد “سياسة الخصوصية وسرية المعلومات” الخاصة بمنصة ahlanwashlan.com
يقوم المستهلك أثناء إتمامه لعمليات الشراء بتزويد منصة ahlanwashlan.com بالمعلومات التالية، وهي على سبيل المثال لا الحصر: الاسم – البريد الالكتروني – الهاتف.
أنظمة منصة ahlanwashlan.com التقنية تحتفظ ببيانات المستهلكين وذلك من اجل تسهيل ولوجهم إلى المنصة وإتمامهم للعمليات الشرائية التي يرغبون بها.
حرصًا من منصة ahlanwashlan.com على حقوق المستهلكين، على الرغم من أن المستهلك ليس طرفاً في هذه الاتفاقية، وتحقيقًا لأحد أهم أهداف منصة ahlanwashlan.com بتقديم خدمة ذات جودة عالية للجميع، ومن باب ضمان استلام المستهلكين لكافة مشترياتهم بشكل سليم فإن منصة ahlanwashlan.com توضّح للمتجر التالي:
في حال قام المستهلك بشراء بضاعة بأحد طرق الدفع المتوفرة على منصة ahlanwashlan.com، ولم يتسلم بضاعته أو أنه تسلم بضاعة تختلف عما عرض من مواصفات ذكرت بصفحة المتجر، حينها يكون من حق المستهلك إبلاغ منصة ahlanwashlan.com ولمنصة ahlanwashlan.com الحق في اتخاذ ما تراه مناسب حيال المتجر الذي خالف قواعد هذه الاتفاقية، وفقاً لقواعد هذه الاتفاقية. غير أن منصة ahlanwashlan.com غير مسئولة قانوناً أو شرعاً عن هذا الإخلال الحاصل من قبل التاجر في مواجهة المستهلك، حيث أنها ليست طرفاً في العلاقة بين المستهلك والتاجر، ولكنها تقوم بذلك لدواعي تحسين جودة منصة ahlanwashlan.com والتجار المتواجدين في المنصة.
للمستهلك مراجعة مشترياته قبل الاستلام للتأكد من أنها سليمة ومطابقة لما تم شرائه، حيث أن منصة ahlanwashlan.com غير مسئولة عن العلاقة التي بين المستهلك والتاجر.
تخضع سرية معلومات المتاجر والتجار لقواعد “سياسة الخصوصية وسرية المعلومات” الخاصة بمنصة ahlanwashlan.com
المادة 18 – سرية المعلومات:
الشبكة العنكبوتية ليس وسيلة آمنة، وسرية المعلومات الشخصية لا يمكن أن تكون مضمونة 100%.
حماية المستخدمين والمستهلكين تتخذ منصة ahlanwashlan.com معايير (ملموسة وتنظيمية وتقنية) ذات جودة عالية لحماية المستخدمين والمستهلكين ومنع وصول شخص غير مفوض إلى معلومات المستخدمين الشخصية أو متاجرهم، وحفظها.
منصة ahlanwashlan.com ليس لها سيطرة على أفعال أي طرف ثالث، أو الغير، مثل صفحات الانترنت الأخرى الموصولة عن طريق روابط إلى المنصة أو أطراف ثالثة تدعي أنها تمثلك وتمثل آخرين.
المادة 19 – سياسة الاستبدال والاسترجاع ودورة التجويل :
19,1-بين التاجر والمنصة:
يمكن إلغاء الاشتراك في باقة (الباقة المجانية والباقة الأساسية) واسترداد رسوم الاشتراك خلال 15 يوم منذ سريان الاشتراك.
في حال إلغاء أي باقة أو رصيد، سيتم احتساب رسوم تحويل لحسابكم البنكي والبالغة
7ريال، بالإضافة إلى أي رسوم اخرى يتم فرضها في سبيل تحقيق ذلك.تت
دورة التحويل يتم تحويل  المدفوعات الالكترونية اوالتحويل البنكي للطلبات التي تمت الى حسابكم البنكي الاساسي بعد سبعة ايام من استلام العميل للمنتج وفرض رسوم التحويل  7 ريال اذا كان حسابكم البنكي بنك محلي غير البنكي الاهلي  اما اذا كان حسابكم البنك الاهلي فلايوجد رسوم التحويل مجانا
19,2-بين التاجر والمستهلك:
 يمكنك إرجاع أو استبدال منتجاتك خلال 7 أيام من تاريخ الشراء أو من تاريخ استلام المنتج فقط في الحالات التالية:
- قبل شحن الطلب يمكن للعميل الغاء الطلب مباشرة من لوحة التحكم الخاصة فيه، وفي حال تم شحن الطلب مع شركة الشحن يتحمل العميل تكلفة الشحن للطلب في حال أراد الإلغاء.
-  يحق للعميل ارجاع المنتج إذا كان معيبا أو غير مطابق للمواصفات التي تم تحديدها وقت الشراء أو نتيجة لخلل أو عيب تصنيع في المنتج، أو كان بحالة متضررة نتيجة الشحن عند التسليم ولن يكون على العميل دفع الرسوم المفروضة على الشحن (على أن يتم إرجاع المنتج بعبوته الأصلية وبكامل ملحقاته ولوازمه وعلى حالته عند الاستلام) وبعد أن يتم تقييم حالة المنتج من قبل الفنيين لدينا سيتم إصدار بوليصة إرجاع خلال سبعة أيام من تاريخ طلب الإرجاع.
-  يستثنى إرجاع المنتجات المخدوشة أو المعطوبة أو نتيجة لسوء الاستخدام أو عطل بسبب توصيل الكهرباء بجهد خاطئ أو عدم تثبيت أو تركيب المنتجات حسب المعايير الفنية الصحيحة.
-   في حالة الإرجاع لأسباب أخرى على سبيل المثال وليس الحصر (حاجة الزبون إلى تبديل المنتج أو تغيرت رغبة الزبون بشكل عام) وليس لأسباب تتعلق بالمنتج نفسه ستكون رسوم الشحن على العميل (على أن يتم إرجاع المنتج بكامل ملحقاته الأصلية وكحالته الأصلية عند استلامه وعدم فتحه) بعد أن يتم تحديد وتقييم حالة المنتج من قبل الفنيين لدينا وفي حال تم فتح الصندوق الخاص بالمنتج فقط فإنه يتم خصم النسبة المئوية التي حددها التاجر في سياسته من قيمة المنتج.
ويُرجع الى سياسة كل تاجر الملحقة بسياسة المنصة فيما يتعلق بسياسة الاستبدال والاسترجاع وايضاً سياسة الشحن والسياسات الاخرى المرتبطة بالعملية موضوع التنفيذ دون أدني مسئوليه على ahlanwashlan.com
 
المادة 20 – إلغاء العضوية أو المتجر: 
إن منصة ahlanwashlan.com بحسب اتفاقية الاستخدام وبحسب القوانين والأنظمة المرعية بالمملكة العربية السعودية قد تلجأ إلى وقف مؤقت أو دائم للمتجر أو سحب وإلغاء عضوية التاجر أو تحديد قدرات التجار على الولوج إلى خدمات منصة ahlanwashlan.com، في حالة:
انتهاك قواعد وأحكام اتفاقية الاستخدام.
إذا لم يكن بإمكان منصة ahlanwashlan.com توثيق أي من معلومات المستخدم المقدمة إليها.
إذا قررت منصة ahlanwashlan.com أن نشاطات المستخدم مخالفة للقانون أو أن نشاطات المستخدم قد تتسبب لمستخدمين آخرين أو لمنصة ahlanwashlan.com بمتاعب أو مخالفات قانونية.
قد تلجأ منصة ahlanwashlan.com  “بحسب تقييمها” إلى إعادة نشاط المستخدمين الموقوفين، حيث أن المستخدم الذي أوقف نشاطه نهائياً أو أُلغيت عضويته، قد لا يكون بإمكانه التسجيل أو استعادة حسابه في منصة ahlanwashlan.com  أو استخدام المنصة بأي طريقة كانت مهما كانت الظروف، لحين السماح له بإعادة نشاطه في منصة ahlanwashlan.com  من قبل إدارة منصة ahlanwashlan.com  ومع ذلك فإن المستخدم في حال انتهاكه لاتفاقية الاستخدام هذه فإن منصة ahlanwashlan.com  تحتفظ بحقها في استعادة أو المطالبة بأي مبالغ مستحقة لمنصة ahlanwashlan.com  على المستخدم وأي خسائر أو أضرار تسبب بها التاجر لمنصة ahlanwashlan.com  كما أن لمنصة ahlanwashlan.com  الحق باتخاذ الإجراءات القانونية أو اللجوء إلى السلطات القضائية في المملكة العربية السعودية ضد المستخدم حسبما تراه منصة ahlanwashlan.com  مناسباً.
إن منصة ahlanwashlan.com لا تتنازل عن حقها في اتخاذ الإجراءات المناسبة حيال أي انتهاك يحدث لقواعد وأحكام اتفاقية الاستخدام ولغيرها من أفعال الانتهاك المشابهة، وكذلك إن منصة ahlanwashlan.com لا تلتزم في القيام باتخاذ أي اجراءات ضد أي انتهاك يحدث لاتفاقية الاستخدام وإنما يخضع هذا الأمر لتقدير إدارة منصة ahlanwashlan.com وإدارتها القانونية.
المادة 21 – إغلاق المتجر:
يحق للتاجر التقدم بطلب إغلاق متجره المسجل في قاعدة بيانات منصة ahlanwashlan.com، ويجب عليه عند تقديم الطلب توفير بعض المستندات، وهي على سبيل المثال لا الحصر: طلب الإغلاق موقع من الممثل النظامي للمتجر ومصادق عليه من الجهات الرسمية.
تحتفظ منصة ahlanwashlan.com بحق قبول أو رفض طلب الإغلاق، والمطالبة بأي حقوق أو مستحقات مالية مستحقة على المتجر.
المادة 22 – عمليات الدفع والبيع والشراء:
يلتزم التاجر بإدارة متجره بشكل جيد، بما يحافظ على المستهلك ولا ينشئ نزاعاً بينه وبين المستهلك.
يلتزم التاجر بإدارة عمليات الدفع والبيع والشراء التي تتم في متجره عبر وسائل الدفع المقرّرة في هذه الاتفاقية.
منصة ahlanwashlan.com لها الحق في رفض أو إلغاء أو تعليق عمليات الشراء سواء تم الدفع أم لم يتم الدفع.
تنوّه منصة ahlanwashlan.com بأنه لا علاقة لها بأي نزاع قد ينشأ بين المستهلك والتاجر، ولا علاقة لمنصة ahlanwashlan.com بأي تقصير يحصل من المستهلك تجاه المتجر، سواءً بتخلّفه عن السداد أو غير ذلك.
يوافق التاجر ويقر أنه لن يقوم بعمليات شراء غير حقيقية أو متلاعبة على منصة ahlanwashlan.com، ولن يستخدم اسم غير حقيقي أو أي معلومات شخصية غير حقيقية، أو استخدام بطاقة ائتمان لا تخصه دون تفويض بالشراء، حيث أن منصة ahlanwashlan.com لها الحق في اتخاذ الإجراءات القانونية المناسبة ضد كل من يقوم بعمليات احتيالية من هذا النوع.
يُقر كافة التُجّار وتُقر كافة المتاجر بعلمهم التام والنافي للجهالة بأن إدارة منصة ahlanwashlan.com في تحويلها للأموال الخاصة بأنشطتهم التجارية داخل منصة ahlanwashlan.com تخضع لسلطة وصلاحيات البنك المركزي بالمملكة العربية السعودية، ونتيجة لذلك فإن منصة ahlanwashlan.com تُنوّه كافة المتاجر والتُجار بأنها قدّ تتأخّر في تحويل بعض الأموال وذلك نتيجة لقيود البنك المركزي ووزارة التجارة والاستثمار وأنظمة التجارة الإلكترونية المفروضة على عمليات البيع والشراء الإلكترونية.
تحتفظ منصة ahlanwashlan.com بحقها في فرض أي رسوم على التُجّار أو المتاجر نتيجة لعملياتهم داخل منصة ahlanwashlan.com، والرسوم قدّ تكون على سبيل المثال لا الحصر: رسوم الجهات الحكومية أو رسوم بنكية أو رسوم إدارية أو أي رسوم أخرى، تجري مطالبة منصة ahlanwashlan.com بدفعها نتيجة لنشاط التاجر أو المتجر.
خدمات الدفع وحساب سداد والفيزا / الماستر كارد والبطاقة الائتمانية
يحق ل ahlanwashlan.com بالنيابة عن المستخدم تزويد سداد أو الفيزا أو الماستر كارد بمعلوماته بناءً على طلب صاحب الحساب بعد اكمال التسجيل.
يقر المستخدم بأن تنشيط حساب سداد و/أو خدمات الدفع ببطاقات الائتمان و/أو فيزا / ماستركارد ستكون مسؤوليته الكاملة بصفته مالكاً للحساب. وإذا كان لا يرغب بالاحتفاظ بها نشطة فمسؤولية الإلغاء تقع على عاتقه أيضًا. حيث أن خدمات سداد و/أو بطاقات فيزا / ماستركارد الائتمانية هي خدمات طرف ثالث وتقع على عاتقه وحده مسؤولية إلغاء التنشيط كون الخدمة مقدمة من طرف ثالث.
بمجرد استخدام حساب سداد و/أو خدمات الدفع ببطاقات ائتمان فيزا / ماستركارد الائتمانية في المتجر فالمستخدم يوافق على الالتزام ببنود حساب سداد و/أو بطاقة فيزا الائتمانية / بطاقة الائتمان الخاصة ببطاقة فيزا / كطرف ثالث كما هو موضح في شروط الاستخدام المعروضة عند تفعيل الخدمة في التطبيق / الموقع. إذا تم التعديل عليها أو التغيير سيتم نشر نسخة جديدة في التطبيق / الموقع. وتكون التعديلات سارية المفعول اعتبارًا من تاريخ النشر. وأي استخدام بعد نشر – تلك التعديلات – بمثابة موافقة على شروط حساب سداد الجديد و / أو شروط خدمات الدفع ببطاقة الائتمان فيزا / ماستركارد. في حال رفض المستخدم لأي تغييرات تطرأ على حساب سداد و / أو شروط الدفع ببطاقة ائتمان فيزا / ماستركارد، فعليه القيام بإلغاء تفعيل حساب سداد و / أو خدمة الدفع ببطاقات الائتمان الخاصة ببطاقة فيزا / ماستركارد وعدم مواصلة استخدام حساب سداد و / أو فيزا / ماستركارد بطاقة الائتمان ضمن خدمات الدفع في المتجر الخاص به.
خدمة التحويل البنكي
يحق ل ahlanwashlan.com تفعيل خدمة التحويل البنكي بمجرد الاشتراك في الخدمة وبناء على طلب صاحب الحساب، وذلك باستخدام المعلومات الخاصة به.
يتحمل المستخدم المسؤولية الكاملة في إدارة خدمات التحويل البنكي بصفته مالك الحساب ويلزم بالحفاظ على معلومات الحساب البنكي الصحيحة لمتجره. صاحب الحساب هو المسؤول عن تنشيط الحساب أو الغاءه. لا تتحمل شركة ahlanwashlan.com مسؤولية أي خسارة أو ضرر ناتج عن إخفاق صاحب الحساب في المحافظة على مدفوعات التحويل البنكي وبياناتها أو في إدارتها.
يُعد صاحب الحساب موافقًا على شروط وأحكام البنك بمجرد استخدام خدمة التحويل البنكي في متجره. لا تتحمل ahlanwashlan.com مسؤولية أي انتهاك لشروط وأحكام البنك. إذا كان صاحب الحساب غير موافق على شروط وأحكام البنك فعليه تعطيل خدمات التحويل البنكي وعدم الاستمرار باستخدامها في المتجر
 
المادة 23-محتويات ومنتجات غير مسموح بها:
كتاجر في منصة ahlanwashlan.com أنت تلتزم بألا تسمح بإعلان أو نشر عبر متجرك لأي محتويات تخالف سياسة الخصوصية وسرية المعلومات أو تخالف قواعد وأحكام اتفاقية الاستخدام هذه.
تمنع منصة ahlanwashlan.com منعا باتا بيع المنتجات والخدمات التالية وهي على سبيل المثال لا الحصر: أي منتج/خدمة تحتوي على مقامرة، صناديق الحظ أو منتج عشوائي، أي منتج/خدمة قد تؤدي إلى أي أذى جسدي أو نفسي بأي شكل من الأشكال، أي محتويات أو اشتراكات مقرصنة وكل ما يخالف حقوق الملكية الفكرية والنشر، أي منتج/خدمة جنسية أو اباحية أو تدعو لذلك.
المادة 24 – تقييد الولوج أو العضوية:
بدون إلحاق الضرر بحقوق التجار الأخرى، يمكن لمنصة ahlanwashlan.com وقف أو إلغاء عضوية التاجر أو تقييد ولوج التاجر إلى خدمات المنصة في أي وقت وبدون إنذار ولأي سبب، ودون تحديد.
 
المادة 25 – الضمان:  
منصة ahlanwashlan.com لا تضمن إصلاح الأعطال ولا تضمن خلو المنتجات التي يقدّمها التجار من أي عيوب أخرى وإنما يضمنها المتجر أو التاجر في حالة ذكر الضمان ومدته وذلك بوصف المنتج، وعلى التاجر أن يلتزم بحسن الجودة في متجره الالكتروني.
المادة 26 – مسئولية التاجر: 
يوافق التاجر على تحمل المسئولية ووقاية منصة ahlanwashlan.com  أو منسوبيها أو مُلّاكها أو المتفرعين عنها من أي ضرر قد يقع على منصة ahlanwashlan.com  من جراء مخالفات التاجر ، كما يلتزم برفع أي ضرر أو منع أي ضرر قد يلحق بمنصة ahlanwashlan.com  أو بمنسوبيها أو بأحدهم من جراء مطالبات أو خسائر أو أعطال أو تكاليف أو نفقات أو رسوم نتجت بسبب إساءة استخدام التاجر أو سوء استخدام المستخدم ونتج عن ذلك خرق لاتفاقية الاستخدام أو الأنظمة والقوانين المرعية بالمملكة العربية السعودية أو تعدي على حقوق أحد التجار أو أطراف ثالثة أو شكوى من أحد المستخدمين أو أطراف ثالثة.
المادة 27 – العلاقة والإشعارات بين منصة ahlanwashlan.com والتجار:
ل             ا تتضمن أي من قواعد وأحكام اتفاقية الاستخدام هذه إشارة إلى وجود شراكة بين أي تاجر ومنصة ahlanwashlan.com، ولا تسمح منصة ahlanwashlan.com لأي تاجر في أي حال من الأحوال بالإشارة المباشرة أو الغير مباشرة أو الإملاء إلى وجود علاقة أي كان نوعها سواء كانت مباشرة أو غير مباشرة بينه كتاجر وبين منصة ahlanwashlan.com أو إدارتها، وأن أي إشعارات يرغب التاجر في إرسالها إلى منصة ahlanwashlan.com، عليه أن يقوم بإرسالها عبر البريد الإلكتروني وتقوم منصة ahlanwashlan.com بالرد على الرسالة الإلكترونية. وأنت كتاجر توافق على أن أي إشعارات ترسل إليك من منصة ahlanwashlan.com سوف تُسلّم إليك بواسطة البريد الإلكتروني الذي قمت بتزويد منصة ahlanwashlan.com به خلال عملية التسجيل.
المادة 28 – نقل الحقوق والالتزامات:
أنت كتاجر لا تملك الحق في الاعتراض على تصرفات إدارة منصة ahlanwashlan.com حيال منصة ahlanwashlan.com سواء كانت هذه التصرفات على سبيل المثال لا الحصر: تمس كيان منصة ahlanwashlan.com أو التزاماتها أو ملكيتها أو مسئولياتها أو تصرفات تقنية أو تصرفات إدارية تتعلّق بمنصة ahlanwashlan.com، وليست مُلزَمة منصة ahlanwashlan.com بإبلاغك، ولمنصة ahlanwashlan.com إن رأت أهمية إبلاغك عن أي من هذه التصرفات أن تقوم بإبلاغك وفقاً لإرادتها المحضة، وذلك بحسب قواعد وأحكام اتفاقية الاستخدام.
​المادة 29 – تعامل المتجر مع
المستهلك:
 يلتزم التاجر بالصدق والأمانة والنزاهة.
يلتزم التاجر عند تعامله مع المستهلك أن يلتزم بحُسن الأخلاق.
المادة 30 – العروض والمنشورات الخاصة بمنصة ahlanwashlan.com:
تسري قواعد وأحكام اتفاقية الاستخدام هذه على كافة المنشورات الدعائية الورقية والإلكترونية عبر مختلف منصات النشر وعبر مختلف وسائل التواصل الاجتماعي.  
المنشورات والمطبوعات المذكورة هي وسيلة ترويجية لمنصة ahlanwashlan.com.
إن المنشورات قابلة للتغيير وهي غير ملزمة لمنصة ahlanwashlan.com فيما يخص ثبات أسعار الخدمات أو الباقات أو العروض وتغيير الأسعار يخضع للمتغيرات التي تطرأ على منصة ahlanwashlan.com أو المتاجر أو التجار.
إن أي عروض تضعها منصة ahlanwashlan.com هي عبارة عن عروض مؤقتة ويتم تحديدها بفترة زمنية محددة، ولا تلتزم منصة ahlanwashlan.com بتمديد الفترة الزمنية أو بالاستمرار في الفترة الزمنية المحددة حيث أنها تملك الحق في الاكتفاء أو تحديد استحقاق أي مستخدم لهذا العرض أو إلغاء هذا العرض في أي وقت.
 
المادة 31– الخدمات اللوجستية والاستراتيجية:
بعض الخدمات المقدمة بواسطة (أطراف ثالثة) على منصة ahlanwashlan.com يستفيد منها التاجر عن طريق بوليات صادرة بالاتفاق بين مزود الخدمة ومنصة ahlanwashlan.com، فيكون استخدامها عن طريق منصة ahlanwashlan.com وقد تحسم منصة ahlanwashlan.com بعض التكاليف منها تنفيذاً للاتفاق الذي بين منصة ahlanwashlan.com ومزوّد الخدمة (أطراف ثالثة)، ولا تقع على عاتق منصة ahlanwashlan.com أي مسؤولية تنتج عن إخلال مزود الخدمة في تقديم خدماته.
بموجب قواعد وأحكام اتفاقية الاستخدام هذه فإن منصة ahlanwashlan.com قدّ توفّر بعض الخدمات الاستراتيجية أو اللوجستية عن طريق طرف ثالث أو أطراف ثالثة، وقدّ تكون هذه الخدمات على سبيل المثال لا الحصر: خدمات شركات الشحن وتوصيل المنتجات والبضائع.
تحيطكم علمًا منصة ahlanwashlan.com بأنها غير مسئولة تمامًا بشكل مباشر أو غير مباشر عن أي تصرفات تصدُر من أي طرف ثالث وأن ما تقوم به هو مجرد ربط بين المستخدم ومُقدِم الخدمة (الطرف الثالث.
تحيطكم علمًا منصة ahlanwashlan.com بأن طلب هذه الخدمة غير إلزامي وإنما يعود هذا الأمر إلى رغبة وحاجة المستخدم، وعند استخدام التاجر لخدمات الطرف الثالث المتوفّر لدى منصة ahlanwashlan.com فإن منصة ahlanwashlan.com تخلي مسئوليتها عن هذه العلاقة وتكون لهذه العلاقة أحكامها المستقلة التي تتم بين التاجر وبين الطرف الثالث.
إن بعض مقدمين الخدمات الاستراتيجية واللوجستية يضعون اشتراطات خاصة بهم أو تكاليف خاصة بهم ولا تملك منصة ahlanwashlan.com أي سلطة على هذه الاشتراطات أو هذه التكاليف، ولذلك تنصح منصة ahlanwashlan.com التجّار المسجّلين لديها إلى الاطلاع على شروط مقدم الخدمة (الطرف الثالث) وتكاليف خدماته قبل تأكيد طلب الخدمة.
في حال تقدّم المستخدم بطلب خدمة مقدّمة عن طريق (طرف ثالث) فإن المستخدم بهذا التصرّف يصرّح لمنصة ahlanwashlan.com ويمنحها الإذن بتزويد مقدم الخدمة (الطرف الثالث) ببيانات المستخدم الشخصية التي يطلبها، وغير ذلك من البيانات التي يحتاجها مقدّم الخدمة (الطرف الثالث)، ويكون ذلك وفقاً لقواعد وأحكام سياسة الخصوصية وسرية المعلومات المعمول بها لدى منصّة ahlanwashlan.com.
 
المادة 32– الدعم الفني:
بموجب قواعد وأحكام اتفاقية الاستخدام هذه فإن منصة ahlanwashlan.com توفّر بعض خدمات الدعم الفني للمتاجر والتُجّار، ويكون ذلك وفقاً لامتيازات الباقة التي يشترك فيها المتجر، وتكون على سبيل المثال:
لوحة تحكم مجانية للمتاجر، وتتضمّن لوحة التحكم بعض الخدمات المجانية.
في حال رغب التاجر بإضافة بعض الخدمات أو بخدمات مختلفة أو بخدمات متعددة فإن ذلك يخضع لسياسة باقات وعروض منصة ahlanwashlan.com والتي غالبًا ما تخضع لرسوم مالية.
تتيح منصة ahlanwashlan.com للمتاجر حق التواصل مع فريق الدعم الفني لمنصة ahlanwashlan.com بما يساعد عمل المتاجر عبر المنصة وحل المسائل الفنية الالكترونية التي قد تطرأ على المتاجر.
المادة 33 – سياسة تلقي شكاوى المستهلكين وتسوية المنازعات فيما بين المستهلك والمتجر:
تأمل منكم منصة ahlanwashlan.com في حال وجود شكوى بحق أحد المستهلكين وإحدى المتاجر، إتباع الخطوات التالية:
الخطوة الأولى: التقدم بشكوى عبر الرابط المخصص لذلك في منصة ahlanwashlan.com، على أن تتضمّن الشكوى: نص الشكوى والمستندات المؤيدة لها – اسم المتجر المخالف. ومن ثم سوف تقوم منصة ahlanwashlan.com بإحالة الشكوى إلى المتجر المعني من أجل حلها.
الخطوة الثانية: في حال عدم تجاوب المتجر مع المستهلك خلال سبعة أيام فسوف تتم إفادة المستهلك بذلك وتزويده بالهوية القانونية للمتجر إن رغب بتقديم شكوى ضده لدى الجهات المختصة.
الخطوة الثالثة: يحق للمستهلك اتخاذ ما يراه مناسباً بعد اطلاعه على مضمون رد المتجر على الشكوى، وفي حال عدم قناعة المستهلك برد المتجر فإنه يحق له طلب الحصول على نسخة من الهوية القانونية للمتجر لاتخاذ ما يراه مناسباً بحق المتجر.
 
المادة 34: -منصة ahlanwashlan.com
يوفر ahlanwashlan.com شبكة رقمية تعمل كموقع تسوق حيث يمكن للأشخاص ("المستخدمين") الساعين للحصول على ترويج السلع بين البائع والمستهلك
ويتعين على كل مستخدم إنشاء حساب مستخدم يُمكِّنه من الوصول إلى ahlanwashlan.com. وأي قرار يتخذه المستخدم فيما يتعلق باستخدام أو بقبول الخدمات يكون بناءً على تقديره الخاص.
لا يُقصد من المواد المنشورة على ahlanwashlan.com إسداء النصح بحيث يمكن الاعتماد عليها. ومن ثم، فإننا نخلي مسؤوليتنا عن أي تبعات أو مسؤولية قانونية تنشأ جراء أي اعتماد لأي زائر ل ahlanwashlan.com على هذه المواد أو أي شخص قد أُحيط علمًا بأي من محتوياتها.
نهدف إلى تحديث ahlanwashlan.com بانتظام، وقد نعدِّل المحتوى في أي وقت. وقد نُعلِّق الوصول إلى ahlanwashlan.com وخدماتها، أو نغلقها إلى أجل غير مسمى إذا دعت الحاجة إلى هذا. وقد تكون أي من المواد الموجودة على ahlanwashlan.com أو الخدمات غير محدثة في أي وقت، ونحن غير ملزمين بتحديث هذه المواد
المادة 35: -الترخيص
تمنحك شركة. اهلا وسهلا............— شريطة امتثالك لهذه الاتفاقية — ترخيصًا محدودًا غير حصري لا يمكن ترخيصه من الباطن قابل للإلغاء أو لا يمكن نقله لأي طرف آخر، من أجل:
1-الوصول إلى ahlanwashlan.com واستخدامها على جهازك الشخصي فيما يتصل باستخدامك ahlanwashlan.com فحسب؛
2-الوصول إلى أي من المحتوى أو المعلومات أو المواد ذات الصلة والتي قد تُوفَّر من خلال ahlanwashlan.com واستخدامها، وفي جميع الحالات يكون الاستخدام للمنصة استخدامًا شخصيًّا فحسب وغير تجاري.
وتحتفظ شركة اهلا وسهلا بأي حقوق غير ممنوحة صراحةً في هذه الاتفاقية.
المادة 36: -الخدمات المقدمة من الغير والمحتوى الخاص به
تجوز إتاحة ahlanwashlan.com أو الوصول إليها فيما يتعلق بالخدمات المقدمة من الغير والمحتويات الخاصة بهم التي لا تخضع لسيطرة شركة اهلا وسهلا وتُقر من جهتك بأن شروط الاستخدام المختلفة وسياسات الخصوصية قد تنطبق على استخدامك هذه الخدمات المقدمة من الغير والمحتوى الخاص بهم. ولا تصادق شركة اهلا وسهلا على هذه الخدمات المقدمة من الغير والمحتويات الخاصة بهم ولن تتحمل شركة ...اهلا وسهلا في أي حال من الأحوال المسؤولية عن أي منتجات أو خدمات يقدمها الغير.
المادة 37: -ملكية ahlanwashlan.com
تبقى ملكية ahlanwashlan.com وجميع الحقوق المتعلقة بها ملكية خاصة لشركة اهلا وسهلا ولا تمنحك هذه الاتفاقية ولا استخدامك ل ahlanwashlan.com أي حقوق:
1-في أو تتعلق ب ahlanwashlan.com باستثناء الترخيص المحدود الممنوح أعلاه؛ أو   
2-لاستخدام أو الإشارة بأي صورة من الصور إلى أسماء شركة اهلا وسهلا أو شعاراتها أو أسماء منتجاتها أو خدامتها أو علاماتها التجارية أو علامات خدماتها.
المادة 38: -حسابات مستخدمين ahlanwashlan.com
من أجل استخدام خدمات ahlanwashlan.com، يتعين عليك التسجيل للحصول على حساب مستخدم شخصي فعَّال والمحافظة عليه ("الحساب"). ويتعين أن يبلغ عمرك 18 عامًا على الأقل حتى يتسنى لك الحصول على حساب.
ويتطلب تسجيل الحساب تقديم بعض المعلومات الشخصية إلى شركة اهلا وسهلا، مثل اسمك وعنوانك ورقم هاتفك الجوال وجنسك وعمرك. وتوافق من جانبك على تدوين معلومات دقيقة وكاملة وحديثة في حسابك الخاص والمحافظة عليها.
قد ينجم عن عدم التزامك المحافظة على معلومات حسابك بحيث تكون دقيقة وكاملة وحديثة إلى عدم تمكنك من الوصول إلى ahlanwashlan.com واستخدامها، بما في ذلك قدرتك على طلب الوصول إلى معلوماتك الشخصية أو الاشتراك في تفضيلات التسوق أو الخروج منها، أو إلى إنهاء شركة اهلا وسهلا لهذه الاتفاقية معك.
وتتحمل المسؤولية عن سائر الأنشطة التي تجري في حسابك، وتوافق على الحفاظ على أمان اسم المستخدم وكلمة المرور الخاصين بحسابك وسريتهما في جميع الأوقات. ولا يحق لك امتلاك أكثر من حساب واحد فقط ما لم تسمح شركة اهلا وسهلا بخلاف ذلك.
المادة 39: -متطلبات المستخدم وسلوكه.
لا يتوفر ahlanwashlan.com للأشخاص دون 18 عامًا، ويستخدمه الأفراد المتمتعون قانونًا بأهلية التعاقد القادرون على الالتزام بعقود ملزمة بموجب القانون المعمول به.
لا يجوز لك السماح للغير باستخدام حسابك، ولا يجوز لك السماح للأشخاص دون 18 عامًا بتلقي خدمات الحجز ما لم يرافقوك أو يرافقوا شخصًا بالغًا آخر.
لا يجوز لك التنازل عن حسابك أو نقل ملكيته إلى أي شخص أو كيان آخر. وتوافق من جانبك على الالتزام بجميع القوانين المعمول بها عند استخدامك ahlanwashlan.com، ولا يحق لك استخدام ahlanwashlan.com إلا لأغراض قانونية.
ولا يجوز أن تتسبب باستخدامك ل ahlanwashlan.com في إلحاق الأذى أو إزعاج أو مضايقة أو الإضرار بالممتلكات، سواء كان ذلك بأي من الكباتن أو الغير أو أي طرف آخر.
وفي بعض الحالات، قد يُطلب منك تقديم إثبات هوية المستخدم للوصول إلى ahlanwashlan.com أو استخدامها، وتوافق من جانبك على أنه قد يُمنع الوصول إلى ahlanwashlan.com أو استخدامها إذا امتنعت عن تقديم إثبات هوية المستخدم.
قد يؤدي عدم الامتثال لشروط هذه الفقرة إلى اتخاذ إجراءات معينة ضدك، بما في ذلك على سبيل المثال لا الحصر:
1-سحب فوري أو مؤقت أو دائم لحقك في استخدام ahlanwashlan.com؛ و/أو
2-اتخاذ إجراءات ضدك بما في ذلك إجراءات سداد جميع التكاليف (بما في ذلك، على سبيل المثال لا الحصر، التكاليف الإدارية والقانونية المعقولة) الناتجة عن هذا الإخلال؛ و/أو
3-الإفصاح عن هذه المعلومات إلى السلطات المكلَّفة بإنفاذ القانون وفقًا لما نراه ضروريًّا، و/أو
 4-إزالة فورية أو مؤقتة أو دائمة لأي نشر أو مادة حملتها إلى خدمتنا.
المادة 40: -الاتصالات.
بمجرد أن تصبح مستخدمًا ل ahlanwashlan.com، فإنك توافق على تلقي اتصالات منا، بما في ذلك عبر البريد الإلكتروني، والرسائل النصية، والمكالمات، وإشعارات الدفع.
وتوافق من جانبك على أنه يمكن إنشاء نصوص أو مكالمات أو رسائل مسجلة مسبقًا بواسطة أنظمة الاتصال الهاتفي التلقائية (حيثما يسمح القانون المحلي بذلك ووفقًا له).
قد تتضمن الاتصالات من شركة اهلا وسهلا على سبيل المثال لا الحصر: الاتصالات التشغيلية المتعلقة بحساب المستخدم الخاص بك أو استخدام ahlanwashlan.com أو خدماتها، والتحديثات المتعلقة بالميزات الجديدة والحالية على ahlanwashlan.com، والأخبار المتعلقة بتطورات شركة اهلا وسهلا وصناعتها.
المادة 41: -ahlanwashlan.com هو وسيط فقط
يقر مستخدمو ahlanwashlan.com بأن التطبيق هو وسيط فقط بين التاجر مقدم الخدمة والعميل.
بمجرد موافقتك على استخدام ahlanwashlan.com، فإنك تقر بـأن ahlanwashlan.com لن يكون مسؤولاً عن أي أضرار يكبدها التاجر مقدم الخدمة أو العميل
المادة 42: -لا دعاية
لا يحق لأي من الطرفين استخدام اسم الطرف الآخر أو الإشارة لاسمه أو شعاره أو علاماته التجارية أو علامات الخدمة الخاصة به في أي بيان صحفي أو غيره دون موافقة كتابية مسبقة من ذلك الطرف الآخر في كل واقعة.
المادة 43: -الأنشطة المحظورة
فيما يتعلق باستخدامك ل ahlanwashlan.com ومشاركتك في الخدمات، فإنك توافق على تجنب القيام بما يلي:
 (1) انتحال شخصية أي شخص أو كيان؛
 (2) مطاردة أو تهديد أو مضايقة أي شخص (بما فيه المستخدمين الآخرين الذين يستفيدون من الخدمة) أو حمل أي أسلحة؛
(3) انتهاك أي قانون أو تشريع أو قاعدة أو تصريح أو مرسوم أو لائحة؛
(4) التدخل في الخدمات أو ahlanwashlan.com أو الخوادم أو الشبكات المتصلة ب ahlanwashlan.com أو تعطيلها؛
(5) إرسال معلومات أو التفاعل على ahlanwashlan.com أو فيما يتعلق بالخدمات بطريقة احتيالية أو غير دقيقة أو مضللة (سواء بصورة مباشرة أو عن طريق الإغفال أو الفشل في تحديث المعلومات) أو تشهيرية أو افترائية أو مسيئة أو فاحشة أو منتهكة أو مسيئة أو ذات توجهات جنسية أو تهديدية أو مزعجة أو غير قانونية؛
(6) تعاطي المخدرات أو المواد الكحولية؛
(7) استخدام ahlanwashlan.com بأي طريقة تنتهك حقوق الغير؛ بما في ذلك على سبيل المثال لا الحصر: حقوق الملكية الفكرية أو حقوق النشر أو البراءة أو العلامة التجارية أو الأسرار التجارية أو حقوق الملكية الأخرى أو حقوق النشر، أو الحق في العلانية أو الخصوصية؛
(8) نشر أو إرسال بريد إلكتروني أو ما يشبه ذلك من إرسال أي تعليمات برمجية ضارة أو ملفات أو برامج أخرى مصممة لعرقلة أو تلف أو تدمير أو تقييد وظيفة أي برنامج كمبيوتر أو جهاز أو معدات اتصالات أو سرقة أو مصادرة أي نظام أو بيانات أو شخصية المعلومات؛
(9) تزوير العناوين الرئيسية أو خلاف ذلك من التلاعب بالمعرفات من أجل إخفاء أصل أي معلومات مرسلة عبر "نظام اهلا وسهلا الأساسي"؛
(10) وضع "إطار" أو عرض صورة مطابقة لأي جزء من ahlanwashlan.com، دون تصريح خطي مسبق أو استخدام العلامات الوصفية أو رمز أو أي أجهزة أخرى تحتوي على أي إشارة لنا من أجل توجيه أي شخص إلى أي موقع ويب آخر لأي غرض؛
(11) تعديل أو تكييف أو ترجمة أو انعكاس هندسة، أو فك شفرة أو تفريغ أو فصل أي جزء من نظام ahlanwashlan.com أو أي البرامج المستخدمة على ahlanwashlan.com أو فيما يتعلق بها؛
(12) تأجير، أو استئجار، أو إقراض، أو بيع، أو إعادة توزيع، أو استصدار ترخيص عادي أو ترخيص من الباطن ل ahlanwashlan.com، أو الوصول إلى أي جزء من ahlanwashlan.com؛
(13) استخدام أي روبوت أو تطبيق بحث / استرداد موقع أو أي جهاز أو عملية يدوية أو تلقائية أخرى لاسترداد البيانات، أو فهرستها، أو حذفها، أو استخراجها، أو بطريقة أو بأخرى استخراج نسخة من التنقل الشبكي ل ahlanwashlan.com أو محتوياتها أو التحايل عليها؛
(14) الارتباط بشكل مباشر أو غير مباشر بأي من مواقع الشبكة العنكبوتية الأخرى؛
(15) نقل أو بيع حساب المستخدم وكلمة المرور و/أو التعريف الخاص بك إلى أي طرف آخر؛
(16) ممارسة التمييز ضد أي شخص أو مضايقته على أساس العرق، أو الأصل القومي، أو الدين، أو الجنس، أو الهوية الجنسية، أو الإعاقة الجسدية أو العقلية، أو الحالة الطبية، أو الحالة الاجتماعية، أو السن، أو الميول الجنسية؛
 (17) حمل الغير على المشاركة في الأنشطة المحظورة أعلاه.
في حالة قيامك بأي مما سبق ذكره في أثناء المشاركة في الخدمات، يجب أن يُسمح للتاجر برفض تقديم الخدمات لك، أو في حالة بدء هذه الخدمات يُسمح للتاجر برفض الاستمرار في تقديم الخدمات لك.
المادة 44: -إخلاء المسؤولية
يتم توفير منصة الخدمات، والخدمات، "كما هي" و"كما هي متوفرة".
تخلي شركة اهلا وسهلا. مسؤوليتها عن جميع الإقرارات والضمانات، سواء أكانت صريحة أم ضمنية أم قانونية، والتي تكون غير منصوص عليها صراحة في هذه الاتفاقية، بما في ذلك الضمانات الضمنية لصلاحية العرض في السوق، والملائمة لغرض معين وعدم المخالفة.
بالإضافة إلى ذلك، لا تقدم شركة اهلا وسهلا أي تعهد أو كفالة أو ضمان فيما يتعلق بالموثوقية أو الملاءمة أو الانضباط أو الجودة أو الجدارة والتوفر ل ahlanwashlan.com أو الخدمات، أو أي خدمات أخرى مطلوبة من خلال استخدام ahlanwashlan.com، أو التي تفيد بعدم توقف الخدمة في ahlanwashlan.com أو خلوها من الأخطاء.
لا تضمن شركة اهلا وسهلا. جودة أو ملاءمة أو سلامة أو المنتج. ينبغي عليك أن توافق على أن جميع المخاطر التي تنشأ عن استخدامك ل ahlanwashlan.com والخدمات، وأي خدمة مطلوبة فيما يتعلق بذلك، تبقى على مسؤوليتك فقط، في الحدود القصوى المسموح بها بموجب القانون المعمول به.
إن شركة اهلا وسهلا غير مسؤولة عن سلوك أي مستخدم أو التاجران أي مزود شبكة الهاتف المحمول أو أي طرف ثالث آخر، سواء كان ذلك عبر الإنترنت أو من غير استخدامه.
نشجعك على استخدام درجة معقولة من الحساسية والحذر في تفاعلاتك مع المستخدمين الآخرين أو مع التاجران أي طرف ثالث آخر.
ولا يتعين علينا توفير تأمين الأمتعة الشخصية بما فيها خسارة الأمتعة الشخصية نتيجة السرقة أو خطفها أو نتيجة نسيان الأمتعة، أو تحمل المسؤولية تجاه تلك الأمتعة.
من خلال استخدامك ل ahlanwashlan.com والمشاركة في الخدمات، أنت توافق على قبول تحمل هذه المخاطر وتوافق على عدم تحميل شركة اهلا وسهلا المسؤولية عن أعمال أو إهمال المستخدمين أو التاجر أو مزود شبكة الهاتف المحمول أو الغير.
لا تتحمل شركة اهلا وسهلا صراحةً أي مسؤولية تنشأ عن الاستخدام غير المصرح به لحساب المستخدم الخاص بك. إذا كنت تشك في أن أي طرف غير مصرح له قد يستخدم حساب المستخدم الخاص بك أو تشك في أي خرق آخر للأمن، ينبغي عليك الموافقة على إخطارنا بذلك على الفور.
تكون بيانات الموقع التي توفرها منصة ahlanwashlan.com لأغراض الموقع الأساسي فقط، ولا يُعتمد عليها في الحالات التي تكون فيها المعلومات الدقيقة عن الموقع مطلوبة أو عندما تكون بيانات الموقع الخاطئة أو غير الدقيقة أو غير المكتملة قد تؤدي إلى الوفاة أو الإصابة الشخصية أو الممتلكات أو حدوث ضرر في البيئة.
لا تضمن شركة اهلا وسهلا المحتوى الخاص بها توفر أو دقة أو اكتمال أو موثوقية أو توقيت بيانات الموقع التي تتبعها أو تعرضها ahlanwashlan.com.
المادة 45: -تقييد المسؤولية
لن تتحمل شركة اهلا وسهلا المسؤولية عن أي أضرار غير مباشرة أو عرضية أو خاصة أو طارئة أو عقابية أو تبعية، بما في ذلك الإصابات الشخصية أو الأضرار التي تلحق بالممتلكات والمتعلقة باستخدام ahlanwashlan.com أو الخدمات، أو فيما يتعلق بذلك، أو التي تنشأ عن هذا الاستخدام خلافًا لذلك، حتى لو تم إخطار شركة اهلا وسهلا باحتمالية حدوث هذه الأضرار. لن تكون شركة اهلا وسهلا مسؤولة عن أي أضرار أو مسؤوليات أو خسائر تنشأ عن الآتي:
1-استخدامك أو اعتمادك على ahlanwashlan.com أو الخدمات أو عدم قدرتك على الوصول إلى ahlanwashlan.com أو الخدمات أو استخدامهما. أو
2-أي معاملة أو علاقة بينك وبين أي التاجر أو أي طرف ثالث آخر، حتى لو كان قد تم إخطار الشركة أو فروعها أو شركائها بإمكانية حدوث هذه الأضرار.
لا تتحمل شركة اهلا وسهلا المسؤولية عن التأخير أو الفشل في أداء الخدمات، والناجم عن أسباب خارج سيطرتنا المعقولة.
يجوز لك استخدام ahlanwashlan.com لطلب الحصول على الخدمات، ولكن بشرط الموافقة على أن عدم تحمل شركة اهلا وسهلا أي مسؤولية أو التزام تجاهك بالنسبة لأي خدمة مقدمة إليك من قِبل التاجر، بخلاف ما ورد صراحة في هذه الاتفاقية.
المادة 46: -الاجراءات الأمنية: -
تلتزم الشركة بتنفيذ الإجراءات الفنية والتنظيمية المناسبة لحماية بيانات لوحة التحكم من المعالجة غير المصرح بها أو غير القانونية وكذلك حمايتها من الفقدان أو التلف أو التدمير أو التغيير أو الإفصاح غير المصرح به، وكذلك ضد أي إخلال بإجراءات الشركة للحفاظ على أمن المعلومات ("واقعة مساس بأمن المعلومات").
المادة 47: -التعويض
يتعين عليك أن توافق على تعويض شركة اهلا وسهلا. ودفع الضرر عن شركة اهلا وسهلا ضد أي مطالبات أو طلبات أو خسائر أو التزامات أو مصاريف (بما في ذلك أتعاب المحاماة) الناشئة عن الآتي أو فيما يتعلق به:
استخدامك ل ahlanwashlan.com والخدمات، أو الخدمات التي يتم الحصول عليها من خلال استخدامك ل ahlanwashlan.com
مخالفتك أو انتهاكك لهذه الاتفاقية
 
المادة 48: -حسابات الأعضاء
يجب أن يكون المستخدم مسجلاً على المواقع للوصول إلى بعض الخدمات أو استخدامها (يُشار أيضًا إلى المستخدم المسجل باسم " العضو " أدناه). باستثناء موافقة ahlanwashlan.com، يجوز لمستخدم واحد فقط تسجيل حساب عضو واحد على المواقع. يجوز لـ ahlanwashlan.com إلغاء حساب عضو مستخدم أو إنهائه إذا كان لدى ahlanwashlan.com أسباب للشك في أن المستخدم قد قام بالتسجيل في نفس الوقت أو أنه يتحكم في حسابين أو أكثر من حسابات الأعضاء. علاوة على ذلك، يجوز لـ ahlanwashlan.com رفض طلب المستخدم للتسجيل لأي سبب.
عند التسجيل على المواقع، يتعين على ahlanwashlan.com تعيين حساب وإصدار معرف العضو وكلمة المرور (يتم اختيار الأخير بواسطة مستخدم مسجل أثناء التسجيل) لكل مستخدم مسجل. قد يكون للحساب حساب بريد إلكتروني على شبكة الإنترنت مع مساحة تخزين محدودة للعضو لإرسال أو استقبال رسائل البريد الإلكتروني.
مجموعة من معرف العضو وكلمة المرور فريدة لحساب واحد. يكون كل عضو مسؤولاً بمفرده عن الحفاظ على سرية وأمن معرف العضو وكلمة المرور الخاصين بك وعن جميع الاستخدامات والأنشطة التي تحدث ضمن حسابك (سواء كان هذا الاستخدام أو الأنشطة مصرحًا به أم لا). لا يجوز لأي عضو أن يقوم أو يعين أو يسمح باستخدام حساب العضو أو المعرف أو كلمة المرور الخاصة بك من قبل شخص آخر، حتى لأفراد آخرين داخل الكيان التجاري الخاص بالعضو (عند الاقتضاء). يوافق العضو على إخطار ahlanwashlan.comعلى الفور إذا علمت بأي استخدام غير مصرح به لكلمة المرور أو حسابك أو أي خرق آخر لأمن حسابك.
يوافق العضو على أن جميع استخدامات المواقع والخدمات، وجميع الأنشطة التي تحدث تحت حسابك (بما في ذلك على سبيل المثال لا الحصر، نشر معلومات عن أي شركة أو منتج، والنقر لقبول أي اتفاقيات أو قواعد إضافية، والاشتراك في أي خدمات أو إجراء أي مدفوعات مقابلها، إرسال رسائل البريد الإلكتروني باستخدام حساب البريد الإلكتروني أو إرسال الرسائل القصيرة) سيعتبر مفوضًا من قبل العضو. 
يقر العضو بأن مشاركة حسابك مع أشخاص آخرين، أو السماح لعدة مستخدمين خارج كيان عملك باستخدام حسابك (بشكل جماعي، " الاستخدام المتعدد ")، قد يتسبب في ضرر لا يمكن إصلاحه لـ ahlanwashlan.com أو مستخدمين آخرين للمواقع. يتعين على العضو تعويض ahlanwashlan.com والشركات التابعة لنا والمديرين والموظفين والوكلاء والممثلين عن أي خسارة أو أضرار (بما في ذلك على سبيل المثال لا الحصر خسارة الأرباح) التي تكبتها نتيجة الاستخدام المتعدد لحسابك. يوافق العضو أيضًا على أنه في حالة الاستخدام المتعدد لحسابك أو فشل العضو في الحفاظ على أمان حسابك، لن تكون ahlanwashlan.com مسؤولة عن أي خسارة أو أضرار تنشأ عن هذا الانتهاك ويكون لها الحق في التعليق أو الإنهاء حساب العضو دون أي مسؤولية تجاه العضو.
 
المادة 49: -مسؤوليات العضو
يقر كل عضو ويضمن ويوافق على
(أ) أن لديك كامل الصلاحية والسلطة لقبول الشروط ومنح الترخيص والتفويض وأداء الالتزامات الواردة أدناه؛
(ب) سيكون وصولك إلى المواقع واستخدامها لأغراض تجارية فقط؛ و
(ج) بالنسبة للأعضاء الذين يمثلون كيانات تجارية، فإن العنوان الذي تقدمه عند التسجيل هو مكان العمل الرئيسي لكيان عملك. لأغراض هذا الحكم، لن يتم اعتبار الفرع أو مكتب الاتصال كيانًا منفصلاً، وسيعتبر مكان عملك الرئيسي هو مكتبك الرئيسي.
سيُطلب من العضو تقديم معلومات أو مواد حول كيانك أو عملك أو منتجاتك / خدماتك كجزء من عملية التسجيل على المواقع للوصول إلى واستخدام أي خدمة أو حساب عضو. يقر كل عضو ويضمن ويوافق على أن
(أ) هذه المعلومات والمواد سواء تم تقديمها أثناء عملية التسجيل أو بعد ذلك خلال استمرار استخدام المواقع أو الخدمة صحيحة ودقيقة وحديثة وكاملة، و
(ب) ستحتفظ بها وتعديل جميع المعلومات والمواد على الفور لإبقائها صحيحة ودقيقة وحديثة وكاملة.
7,3 بعد أن تصبح عضوًا، فإنك توافق على إدراج معلومات الاتصال الخاصة بك في قاعدة بياناتنا وتفوض ahlanwashlan.com والشركات التابعة لنا بمشاركة معلومات الاتصال مع مستخدمين آخرين أو استخدام معلوماتك الشخصية بطريقة أخرى وفقًا الخصوصية.
يقر كل عضو ويتعهد ويوافق على أنه
(أ) ستكون مسؤولاً بمفردك عن الحصول على جميع التراخيص والأذونات اللازمة لأطراف أخرى فيما يتعلق بأي محتوى مستخدم ترسله أو تنشره أو تعرضه؛
(ب) أي محتوى مستخدم ترسله أو تنشره أو تعرضه لا ينتهك أو ينتهك أيًا من حقوق الطبع والنشر أو براءات الاختراع أو العلامة التجارية أو الاسم التجاري أو الأسرار التجارية أو أي حقوق شخصية أو حقوق ملكية أخرى لأي طرف ثالث (" حقوق الطرف الثالث ")؛ و
(ج) لديك الحق والسلطة في بيع أو تداول أو توزيع أو تصدير أو عرض بيع أو تداول أو توزيع أو تصدير المنتجات أو الخدمات الموضحة في محتوى المستخدم ولا يعتبر هذا البيع أو التجارة أو التوزيع أو التصدير أو العرض تنتهك أي حق لطرف ثالث ； و
(د) لم يتم حظر العضو أو أي من الأشخاص المرتبطين به أو إزالته من أي منصات تجارة إلكترونية رئيسية، أو التورط بطريقة أخرى في بيع المنتجات المقلدة أو المقرصنة عبر الإنترنت.
يقر كل عضو ويضمن ويوافق على أن محتوى المستخدم الذي ترسله أو تنشره أو تعرضه يجب:
 أ) أن يكون صحيحًا ودقيقًا وكاملاً وقانونياً؛
ب) ألا تكون خاطئة أو مضللة أو خادعة؛
 ج) لا تحتوي على معلومات تشهيرية أو تشهيرية أو تهديدية أو مضايقة أو فاحشة أو مرفوضة أو مسيئة أو جنسية صريحة أو ضارة للقصر؛
 د) لا تحتوي على معلومات تمييزية أو تعزز التمييز على أساس العرق أو الجنس أو الدين أو الجنسية أو الإعاقة أو الجنس أو المهنة أو العمر؛
 هـ) لا تنتهك أي قوانين ولوائح سارية (بما في ذلك على سبيل المثال لا الحصر تلك التي تحكم مراقبة الصادرات أو حماية المستهلك أو المنافسة غير العادلة أو التلاعب في الأسعار أو الدعاية الكاذبة) أو الترويج لأي أنشطة التي قد تنتهك أي قوانين ولوائح معمول بها؛
و) لا تحتوي على أي رابط بشكل مباشر أو غير مباشر إلى أي مواقع ويب أخرى تتضمن أي محتوى قد ينتهك الشروط. 
يقر كل عضو ويضمن ويوافق على أنك يجب / تقوم بما يلي:
 أ) الاستمرار في أنشطتك على المواقع وفقًا لأي قوانين ولوائح معمول بها في المملكة العربية السعودية؛
ب) إجراء معاملاتك التجارية مع المستخدمين الآخرين للمواقع بحسن نية؛
 ج) الاستمرار في أنشطتك وفقًا للشروط وأي اتفاقيات إضافية سارية؛
 د) عدم استخدام الخدمات أو المواقع للاحتيال على أي شخص أو كيان (بما في ذلك على سبيل المثال لا الحصر بيع العناصر المسروقة، واستخدام بطاقات الائتمان / الخصم المسروقة)؛
 هـ) عدم انتحال شخصية أي شخص أو كيان أو تحريف نفسك أو انتسابك لأي شخص أو كيان؛
 و) عدم الانخراط في البريد العشوائي أو التصدي الاحتيالي؛
 ز) عدم الانخراط في أي أنشطة غير قانونية أخرى (بما في ذلك على سبيل المثال لا الحصر تلك التي قد تشكل جريمة جنائية أو تؤدي إلى مسؤولية مدنية، إلخ) أو تشجع أو تحرض على أي أنشطة غير قانونية؛
ح) لا تنطوي على محاولات لنسخ أو إعادة إنتاج أو استغلال أو مصادرة الدلائل وقواعد البيانات والقوائم المختلفة الخاصة بـ ahlanwashlan.com؛
ط) لا تنطوي على أي فيروسات كمبيوتر أو غيرها من الأجهزة المدمرة والرموز التي لها تأثير إتلاف أو التدخل في أو اعتراض أو مصادرة أي برنامج أو نظام أجهزة أو بيانات أو معلومات شخصية؛
ي) لا تتضمن أي مخطط لتقويض سلامة البيانات أو الأنظمة أو الشبكات التي تستخدمها ahlanwashlan.com و / أو أي مستخدم للمواقع أو الحصول على وصول غير مصرح به إلى هذه البيانات أو الأنظمة أو الشبكات؛
 ك) لا، ومديرك (مديرك)، والمسؤول (المسؤولون)، والطرف / المؤسسات المسيطرة، والشركات التابعة، والولاية القضائية القانونية التي يتم فيها تنظيم أي من الأشخاص أو الكيانات المذكورة أعلاه أو لديها عمليات ليست، أشخاصًا أو كيانات خاضعة لأي عقوبات اقتصادية أو احتيالية لأي كيانات حكومية أو دولية أو تنظيمية؛
 ل) عدم الانخراط في أي أنشطة من شأنها أن تؤدي بخلاف ذلك إلى إنشاء أي مسؤولية على ahlanwashlan.com أو الشركات التابعة لنا.
لا يجوز للعضو استخدام المواقع أو حساب العضو للمشاركة في أنشطة مماثلة أو مشابهة لأعمال سوق التجارة الإلكترونية في ahlanwashlan.com.
إذا قدم العضو حكمًا تجاريًا، فإن العضو يمثل ويضمن ويوافق على أنك قد حصلت على جميع الموافقات والموافقات والإعفاءات اللازمة من هذا الحكم إلى
(أ) العمل كمحكم لشركتك؛
(ب) نشر ونشر تفاصيل الاتصال الخاصة بهم والمعلومات والرسائل المرجعية والتعليقات نيابة عنهم؛ و
(ج) أن الأطراف الثالثة قد تتصل بحكام الأعمال هؤلاء لدعم المطالبات أو البيانات المقدمة عنك. كما تتعهد وتوافق على أن جميع الرسائل المرجعية والتعليقات صحيحة ودقيقة وأنه يجوز لأطراف ثالثة الاتصال بحكام الأعمال دون الحاجة إلى الحصول على موافقتك.
يوافق العضو على تقديم جميع المعلومات والمواد والموافقات اللازمة، وتقديم كل المساعدة المعقولة والتعاون اللازمين لتوفير ahlanwashlan.com للخدمات، وتقييم ما إذا كان العضو قد انتهك الشروط و / أو تعامل مع أي شكوى ضد العضو. إذا أدى فشل العضو في القيام بذلك إلى تأخير أو تعليق أو إنهاء تقديم أي خدمة، فلن تكون ahlanwashlan.com. ملزمة بتمديد فترة الخدمة ذات الصلة ولن تكون مسؤولة عن أي خسارة أو أضرار تنشأ عن أو فيما يتعلق بهذا التأخير أو التعليق أو الإنهاء.
يقر العضو ويوافق على أن ahlanwashlan.com يحتفظ بالحق في، ولكن لا يُطلب منه مراقبة أو ممارسة أي سيطرة تحريرية على الإطلاق على محتوى أي رسالة أو مادة أو معلومات (بما في ذلك محتوى المستخدم) تم إنشاؤها أو الحصول عليها أو الوصول إليها من خلال الخدمات أو المواقع. لا تصادق ahlanwashlan.com على محتويات أي تعليقات أو مواد أو معلومات أخرى (بما في ذلك محتوى المستخدم) تم إنشاؤها أو إرسالها أو نشرها أو عرضها أو تقديمها بواسطة أي عضو أو تتحقق منها أو تصادق عليها بأي طريقة أخرى. كل عضو مسؤول بمفرده عن محتويات اتصالاته وقد يكون مسؤولاً قانونيًا أو مسؤولاً عن محتوى تعليقاته أو مواد أو معلومات أخرى
يمثل كل عضو ويضمن ويوافق على ذلك
(أ) يجب عليك (انت أو / انت الشركات التابعة لك) الامتثال للقوانين واللوائح المعمول بها في إدارة الأعمال الخاصة بك (بما في ذلك على سبيل المثال لا الحصر القوانين واللوائح المعمول بها فيما يتعلق بسلامة المنتج وحقوق الملكية الفكرية وخصوصية البيانات وحماية المستهلك والمنتج أو الشهادة التنظيمية والاستيراد ومراقبة الصادرات، المنافسة غير العادلة، التلاعب في الأسعار، الدعاية الكاذبة، العمالة، البيئة، الصحة والسلامة، مكافحة الرشوة ومكافحة غسيل الأموال).
(ب) لا تخضع (انت أو / انت الشركات التابعة لك) لأي قيود تجارية أو عقوبات أو قيود قانونية أخرى تم سنها أو اقتراح فرضها من قبل أي دولة أو منظمة دولية أو سلطة قضائية (" الموضوعات ذات الصلة ")؛
(ج) لا تقدم (انت أو / انت الشركات التابعة لك) منتجات أو خدمات من المحتمل أن تؤدي إلى فرض أي قيود أو عقوبات أو قيود قانونية أخرى على التجارة الدولية من قبل أي من الموضوعات ذات الصلة؛
(د) لا تتعامل (انت أو / انت الشركات التابعة لك)، بشكل مباشر أو غير مباشر، مع أو تقدم أي أموال أو سلع أو خدمات إلى الموضوعات ذات الصلة؛
(هـ) ستمتثل في جميع الأوقات لجميع قوانين واللوائح المعمول بها فيما يتعلق بالمنتجات؛
إذا فشلت، في أي وقت، في تلبية أي من المتطلبات المذكورة أعلاه، يجب عليك التوقف عن استخدام الخدمات على الفور. إذا اعتقدت ahlanwashlan.com بشكل معقول أن أيًا من سلوكك ينتهك أو يهدد بانتهاك أي قوانين ولوائح سارية، فيجوز لـ ahlanwashlan.com، وفقًا لتقديرها الخاص، في أي وقت اتخاذ الإجراء الذي تراه مناسبًا في ضوء الظروف، بما في ذلك، على سبيل المثال لا الحصر، إنهاء توفير الخدمات لك، وإغلاق أوامر الشراء ذات الصلة، وإنهاء حساباتك، مع الاحتفاظ بجميع الحقوق التي قد تكون لها فيما يتعلق بأي إجراءات أو سلوك غير ممتثل لأعضائها.
المادة 50: -انتهاكات الأعضاء
تحتفظ ahlanwashlan.com بالحق وفقًا لتقديرنا الخاص في إزالة أو تعديل أو رفض أي محتوى مستخدم (كليًا أو جزئيًا) ترسله أو تنشره أو تعرضه على المواقع التي نعتقد بشكل معقول: -
 (1) أنها تنتهك أي قوانين معمول بها واللوائح،
(2) تنتهك الشروط الواردة أدناه، (3) قد تُخضع ahlanwashlan.com أو الشركات التابعة لنا للمسؤولية،
(4) تنتهك أي حقوق لطرف ثالث،
(5) قد تضر بمصالح أعضائنا أو الطرف الثالث أو ahlanwashlan.com أو الشركات التابعة لنا، أو
(6) غير مناسب وفقًا لتقدير ahlanwashlan.com وحدها. 
إذا انتهك أي عضو أي شروط، أو إذا كان لدى ahlanwashlan.com أسباب معقولة للاعتقاد بأن أحد الأعضاء ينتهك أي شروط، فيجب على ahlanwashlan.com اتخاذ الإجراءات التي تراها مناسبة، بما في ذلك على سبيل المثال لا الحصر:
(1) تعليق أو إنهاء حساب العضو وأي وجميع الحسابات التي تم تحديد ارتباطها بهذا الحساب بواسطة ahlanwashlan.com وفقًا لتقديرها الخاص دون تحمل المسؤولية عن أي خسائر أو أضرار تنشأ عن هذا التعليق أو الإنهاء أو فيما يتعلق به؛
(2) تقييد أو تخفيض أو تعليق أو إنهاء الاشتراك في أي خدمة أو الوصول إليها أو الاستخدام الحالي أو المستقبلي لأي خدمة؛
(3) إزالة أي قوائم منتجات أو محتوى مستخدم آخر قدمه العضو أو نشره أو عرضه، أو فرض قيودًا على عدد قوائم المنتجات أو محتوى المستخدم الذي قد ينشره العضو أو يعرضه؛
(4) فرض قيود أخرى على استخدام العضو لأية ميزات أو وظائف لأي خدمة حسبما تراه ahlanwashlan.comمناسبًا وفقًا لتقديرها الخاص؛ و
(5) أي إجراءات تصحيحية أو إجراءات أو عقوبات أخرى قد تراها ahlanwashlan.com ضرورية أو مناسبة وفقًا لتقديرها الخاص. 
دون تقييد عمومية أحكام الشروط، سيتم اعتبار العضو مخالفًا للشروط في أي من الظروف التالية:
 أ) بناءً على شكوى أو مطالبة من أي طرف ثالث، يكون لدى ahlanwashlan.com أسباب معقولة للاعتقاد أن هذا العضو قد فشل عمدًا أو ماديًا في تنفيذ عقدك مع هذا الطرف الثالث، بما في ذلك على سبيل المثال لا الحصر، إذا فشل العضو الذي يقوم بتزويد المنتجات أو الخدمات باستخدام المواقع والخدمات في تسليم أي عناصر طلبها هذا الطرف الثالث بعد استلام سعر الشراء، أو عندما تفشل العناصر التي قدمها هذا العضو فعليًا في تلبية الشروط والأوصاف الموضحة في عقدك مع هذا الطرف الثالث،
 ب) لدى ahlanwashlan.com أسباب معقولة للشك في أن هذا العضو قد استخدم بطاقة ائتمان مسروقة أو معلومات أخرى خاطئة أو مضللة في أي معاملة مع طرف مقابل،
 ج) لدى ahlanwashlan.com أسباب معقولة للاشتباه في أن أي معلومات قدمها العضو ليست سارية أو كاملة أو غير صحيحة أو غير دقيقة أو مضللة، أو
 د) تعتقد ahlanwashlan.com أن إجراءات العضو قد تتسبب في خسارة مالية أو مسؤولية قانونية تجاه ahlanwashlan.com أو الشركات التابعة لنا أو أي مستخدمين آخرين.
تحتفظ ahlanwashlan.com بالحق في التعاون الكامل مع السلطات الحكومية أو التنظيمية وهيئات إنفاذ القانون والمحققين الخاصين و / أو الأطراف الثالثة المتضررة في التحقيق في أي مخالفة جنائية أو مدنية مشتبه بها. علاوة على ذلك، إلى الحد الذي تسمح به القوانين والسياسات المعمول بها، يجوز لشركة ahlanwashlan.com الكشف عن هوية العضو و / أو معلومات الاتصال و / أو المعلومات المتعلقة بحساب (حسابات) العضو أو المعاملات أو الأنشطة المنفذة على الموقع أو عبره، إذا طلب ذلك من قبل هيئة حكومية أو تنظيمية أو هيئة إنفاذ القانون أو طرف ثالث متضرر، أو نتيجة لاستدعاء أو إجراء قانوني آخر.
 لن تكون ahlanwashlan.com مسؤولة عن الأضرار أو النتائج الناشئة عن هذا الكشف، ويوافق العضو على عدم رفع أي دعوى أو دعوى ضد ahlanwashlan.com بسبب هذا الكشف.
يجوز لشركة ahlanwashlan.com، في أي وقت ووفقًا لتقديرنا المعقول، فرض قيود على أو تعليق أو إنهاء استخدام العضو لأي خدمة أو مواقع دون أن يكون مسؤولاً أمام العضو إذا تلقت ahlanwashlan.com إشعارًا بأن العضو قد انتهك أي اتفاق أو تعهد مع أي شركة تابعة لـ ahlanwashlan.com وهذا الانتهاك ينطوي أو يشتبه بشكل معقول في أنه ينطوي على أنشطة غير شريفة أو احتيالية. تحتفظ ahlanwashlan.com بالحق في التحقيق في هذا الانتهاك أو طلب التأكيد من العضو، ولكن لن يكون مطلوبًا منه ذلك.
يوافق كل عضو على تعويض ahlanwashlan.com، والشركات التابعة لنا، والمديرين، والموظفين، والوكلاء، والممثلين وإبعادهم عن أي وجميع الأضرار والخسائر والمطالبات والالتزامات (بما في ذلك التكاليف القانونية على أساس التعويض الكامل) التي قد تنشأ من إرسال أو نشر أو عرض أي محتوى مستخدم، من وصولك إلى المواقع أو الخدمات أو استخدامها، أو من خرقك للشروط أو أي اتفاقيات إضافية. 
يوافق كل عضو أيضًا على أن ahlanwashlan.com ليست مسؤولة ولن تتحمل أي مسؤولية تجاهك أو تجاه أي شخص آخر عن أي محتوى مستخدم أو أي مادة أخرى يتم نقلها عبر المواقع، بما في ذلك الاحتيال أو غير الصحيح أو المضلل أو غير الدقيق أو التشهيري أو المسيء أو المواد غير المشروعة وأن مخاطر الضرر من محتوى المستخدم أو المواد الأخرى تقع بالكامل على عاتق العضو. تحتفظ ahlanwashlan.com بالحق، على نفقتنا الخاصة، في تولي الدفاع الحصري والتحكم في أي مسألة خاضعة بخلاف ذلك للتعويض من قبل العضو، وفي هذه الحالة يتعاون العضو مع ahlanwashlan.com في تأكيد أي دفاعات متاحة.
المادة 51: -تحديد المسؤولية
إلى الحد الأقصى الذي يسمح به القانون، فإن الخدمات المقدمة من موقع ahlanwashlan.com على المواقع أو من خلالها يتم تقديمها "كما هي"، "كما هي متوفرة" و "مع جميع العيوب"، وتخلي ahlanwashlan.com بموجب هذا صراحة مسؤوليتها عن أي وجميع الضمانات، صريحة أو ضمنية، بما في ذلك على سبيل المثال لا الحصر، أي ضمانات للشروط أو الجودة أو المتانة أو الأداء أو الدقة أو الموثوقية أو القابلية للتسويق أو الملاءمة لغرض معين. جميع هذه الضمانات والإقرارات والشروط والتعهدات مستثناة بموجب هذا الاتفاق.
إلى الحد الأقصى الذي يسمح به القانون ، لا تقدم ahlanwashlan.com أي إقرارات أو ضمانات بشأن صحة أو دقة أو صحة أو موثوقية أو جودة أو استقرار أو اكتمال أو حداثة أي من المعلومات الواردة في هذه المعلومات ؛ ahlanwashlan.com لا تتعهد أو تضمن أن التصنيع ، والاستيراد ، والتصدير ، والتوزيع ، والعرض ، والشراء ، والبيع و / أو استخدام المنتجات أو الخدمات المعروضة أو المعروضة على المواقع لا تنتهك أي حقوق لطرف ثالث ؛ ولا تقدم ahlanwashlan.com أي تعهدات أو ضمانات من أي نوع فيما يتعلق بأي منتج أو خدمة معروضة أو معروضة على المواقع. 
يتم تنزيل أي مادة أو الحصول عليها بطريقة أخرى من خلال المواقع أو الخدمات وفقًا لتقدير كل مستخدم وعلى مسؤوليته الخاصة وكل مستخدم هو المسؤول الوحيد عن أي ضرر يلحق بنظام (أنظمة) كمبيوتر ahlanwashlan.com أو أي فقد للبيانات قد نتيجة تنزيل أي من هذه المواد. لا تُنشئ أي نصيحة أو معلومات، سواء كانت شفهية أو مكتوبة، حصل عليها أي مستخدم من ahlanwashlan.com أو من خلال المواقع أو من خلالها، أي ضمان غير منصوص عليه صراحةً في هذه الوثيقة.
قد تتيح المواقع خدمات المستخدم أو المنتجات التي تقدمها جهات خارجية مستقلة. لا يوجد ضمان أو تمثيل فيما يتعلق بهذه الخدمات أو المنتجات. لن تتحمل ahlanwashlan.com أو الشركات التابعة لنا بأي حال من الأحوال المسؤولية عن أي من هذه الخدمات أو المنتجات.
يوافق كل مستخدم بموجب هذا على تعويض ahlanwashlan.com، والشركات التابعة لنا، والمديرين، والمسؤولين والموظفين من أي وجميع الخسائر والمطالبات والالتزامات (بما في ذلك التكاليف القانونية على أساس التعويض الكامل) التي قد تنشأ عن وصول هذا المستخدم إلى أو استخدام المواقع أو الخدمات (بما في ذلك على سبيل المثال لا الحصر تقديم أو نشر أو عرض معلومات المستخدم ومحتوى المستخدم على المواقع أو قنوات الطرف الثالث ضمن خدمات الترويج) أو من خرقك لأي من الإقرارات، الضمانات الواردة أدناه وشروط وأحكام الشروط. يوافق كل مستخدم بموجبه أيضًا على تعويض ahlanwashlan.com، والشركات التابعة لنا، والمديرين، والمسؤولين والموظفين وحمايتهم من أي وجميع الخسائر والأضرار والمطالبات والمسؤوليات (بما في ذلك التكاليف القانونية على أساس التعويض الكامل) التي قد تنشأ عن خرق المستخدم أي تعهدات وضمانات قدمها المستخدم إلى ahlanwashlan.com.
يوافق كل مستخدم بموجب هذا على تعويض ahlanwashlan.com والشركات التابعة لنا والمديرين والمسؤولين والموظفين وحفظها من أي وجميع الخسائر والأضرار والمطالبات والمسؤوليات (بما في ذلك التكاليف القانونية على أساس التعويض الكامل) التي قد تنشأ مباشرة أو بشكل غير مباشر، نتيجة لأي مطالبات أكدها مطالبو حقوق الطرف الثالث أو أطراف ثالثة أخرى تتعلق بمحتوى المستخدم و / أو المعلومات و / أو المنتجات المعروضة أو المعروضة على المواقع. يوافق كل مستخدم بموجبه أيضًا على أن ahlanwashlan.com ليست مسؤولة ولن تتحمل أي مسؤولية تجاهك، عن أي مادة منشورة من قبل الآخرين، بما في ذلك المواد التشهيرية أو المسيئة أو غير المشروعة وأن مخاطر الأضرار الناجمة عن هذه المواد تقع بالكامل على عاتق كل مستخدم. تحتفظ ahlanwashlan.com بالحق، على نفقتنا الخاصة، في تولي الدفاع الحصري والتحكم في أي مسألة خاضعة بخلاف ذلك للتعويض من جانبك، وفي هذه الحالة يجب عليك التعاون مع ahlanwashlan.com في تأكيد أي دفاعات متاحة.
لن تكون ahlanwashlan.com مسؤولة عن أي أضرار خاصة أو مباشرة أو غير مباشرة أو عقابية أو عرضية أو تبعية أو أي أضرار من أي نوع (بما في ذلك على سبيل المثال لا الحصر الأضرار الناجمة عن خسارة الأرباح أو المدخرات أو انقطاع العمل أو فقدان المعلومات)، سواء في العقد أو الإهمال أو المسؤولية التقصيرية أو حقوق الملكية أو غير ذلك أو أي أضرار أخرى ناتجة عن أي مما يلي:
 أ) استخدام أو عدم القدرة على استخدام المواقع أو الخدمات؛
 ب) أي خلل في السلع أو العينات أو البيانات أو المعلومات أو الخدمات التي تم شراؤها أو الحصول عليها من مستخدم أو أي طرف ثالث من خلال المواقع أو الخدمات؛
 ج) انتهاك حقوق الطرف الثالث أو الادعاءات أو المطالبات بأن تصنيع المستخدم أو استيراده أو تصديره أو توزيعه أو عرضه أو شرائه أو بيعه و / أو استخدامه للمنتجات أو الخدمات المعروضة أو المعروضة على المواقع أو من خلال الخدمات قد ينتهك أو قد ينتهك يتم التأكيد على انتهاك حقوق الطرف الثالث ؛ أو الادعاءات من قبل أي طرف بأنه يحق له الدفاع أو التعويض فيما يتعلق بتأكيدات الحقوق أو المطالب أو المطالبات من قبل المطالبين بحقوق الطرف الثالث ؛ د) الوصول غير المصرح به من قبل أطراف ثالثة إلى البيانات أو المعلومات الخاصة لأي مستخدم ؛
 هـ) بيانات أو سلوك أي مستخدم للمواقع أو الخدمات؛ وأي أمور تتعلق بالمواقع أو الخدمات، مهما كانت ناشئة، بما في ذلك الإهمال.
على الرغم من أي من الأحكام السابقة، فإن المسؤولية الإجمالية لـ ahlanwashlan.com أو موظفينا أو وكلائنا أو الشركات التابعة لنا أو الممثلين أو أي شخص يتصرف نيابة عنا فيما يتعلق بكل مستخدم فيما يتعلق بجميع المطالبات الناشئة عن الوصول إلى المواقع أو الخدمات أو استخدامها خلال أي سنة تقويمية، يجب أن يقتصر على ما يزيد عن: -
 (أ) مبلغ الرسوم التي دفعها المستخدم إلى ahlanwashlan.com مقابل الوصول إلى الموقع أو الخدمات أو استخدامه خلال السنة التقويمية و
(ب) الحد الأقصى للمبلغ مسموح به بموجب القانون المعمول به. لا تستبعد الجملة السابقة مطالبة المستخدم بإثبات الأضرار الفعلية.
 يجب تقديم جميع المطالبات الناشئة عن استخدام المواقع أو الخدمات في غضون عام واحد (1) من تاريخ ظهور سبب الدعوى أو تلك الفترة الأطول على النحو المنصوص عليه بموجب القانون المعمول به الذي يحكم الشروط.
تنطبق قيود واستثناءات المسؤولية تجاهك بموجب الشروط إلى أقصى حد يسمح به القانون، وسواء تم إخطار ahlanwashlan.com أو كان من المفترض أن تكون على دراية باحتمال حدوث أي من هذه الخسائر أم لا.
المادة 52: -القوة القاهرة
لا تتحمل ahlanwashlan.com.  مسؤولية أو مطالبة بدفع أي تعويض من أي نوع كان عن أي خسارة تنشأ عن عدم توفر الخدمات أو الأنظمة أو إزعاجها أو فشلها للأسباب التالية:
(1) إيقاف تشغيل النظام بسبب الصيانة؛
(2) عدم القدرة على إرسال البيانات بسبب أعطال في محطات الاتصالات أو معدات الاتصالات؛
(3) فشل الأنظمة وعدم قدرتها على أداء وظائفها بسبب أحداث القوة القاهرة بما في ذلك على سبيل المثال لا الحصر الأعاصير والزلازل والتسونامي والفيضانات وانقطاع التيار الكهربائي والحرائق والعواصف والحرب والاضطرابات السياسية والإضرابات العمالية ونقص العمالة أو المواد، أعمال الشغب، العصيان، الاضطرابات المدنية، الهجمات الإرهابية، التفجيرات، القضاء والقدر، الإجراءات الحكومية، أوامر المحاكم أو المحاكم المحلية أو الأجنبية، عدم أداء الأطراف الثالثة؛ أو
(4) تعليق أو تأخير الخدمات أو فشل الأنظمة لأسباب خارجة عن السيطرة المعقولة لـ ahlanwashlan.com. مثل القراصنة أو الهجمات الإلكترونية أو التعديلات الفنية أو فشل قسم الاتصالات أو ترقيات موقع الويب أو مشاكل الطرف الثالث أو أي تعليق أو تعطيل النقل أو التشغيل التجاري (بما في ذلك على سبيل المثال لا الحصر التأخير أو تعطيل استئناف العمل أو التشغيل الذي أمرت به أي وكالة حكومية) في حالة انتشار الوباء أو الجائحة على المستوى الوطني أو الإقليمي.
المادة 53: -حقوق الملكية الفكرية
Ahlanwashlan.com هو المالك الوحيد أو المرخص له بشكل قانوني لجميع الحقوق والمصالح في المواقع ومحتوى الموقع. تجسد المواقع ومحتوى الموقع الأسرار التجارية وحقوق الملكية الفكرية الأخرى المحمية بموجب حقوق النشر العالمية والقوانين الأخرى. يجب أن تظل جميع حقوق الملكية والملكية وحقوق الملكية الفكرية في المواقع ومحتوى الموقع مع ahlanwashlan.com أو الشركات التابعة لنا أو المرخصين، حسب الحالة. جميع الحقوق التي لم تتم المطالبة بها بموجب الشروط أو بواسطة ahlanwashlan.com محفوظة.
 إلى أقصى حد مسموح به بموجب القانون المعمول به، يجب أن تنتمي جميع الحقوق والملكية والمصلحة لجميع الأعمال المشتقة التي أنشأتها ahlanwashlan.com و / أو الشركات التابعة لها باستخدام محتوى المستخدم وفقًا للشروط إلى ahlanwashlan.com، والتي يمكن التنازل عنها بحرية، المرخصة أو الممنوحة من قبل ahlanwashlan.com إلى أي طرف ثالث أو الشركات التابعة لها.
المادة 54: -الإطارات
يجب إرسال جميع الإشعارات أو الطلبات القانونية إلى ahlanwashlan.com أو عليها كتابيًا وإرسالها إلى ahlanwashlan.com شخصيًا أو بالبريد السريع أو بالبريد المعتمد إلى الكيان والعنوان تصبح الإشعارات سارية عند استلامها بواسطة ahlanwashlan.com بالطريقة المذكورة أعلاه.
تسري جميع الإشعارات أو الطلبات القانونية إلى المستخدم أو عليه إذا تم تسليمها شخصيًا أو إرسالها عن طريق البريد أو البريد المعتمد أو الفاكس أو البريد الإلكتروني إلى آخر مراسلات أو فاكس أو عنوان بريد إلكتروني معروف قدمه المستخدم إلى ahlanwashlan.com، أو عن طريق نشر هذا الإشعار أو الطلب على منطقة من المواقع يمكن الوصول إليها للجمهور دون مقابل. يعتبر إشعار المستخدم مستلمًا من قبل هذا المستخدم إذا ومتى:
أ) تستطيع ahlanwashlan.com إثبات أن الاتصال، سواء كان في شكل مادي أو إلكتروني، قد تم إرساله إلى هذا المستخدم
 ب) فور نشر ahlanwashlan.com مثل هذا الإشعار في منطقة من المواقع يمكن الوصول إليها بشكل عام دون مقابل.
أنت توافق على أن جميع الاتفاقيات والإشعارات والطلبات والإقصاءات وغيرها من الاتصالات التي ترسلها ahlanwashlan.com إليك إلكترونيًا ستفي بأي شرط قانوني يفرض أن يكون هذا الاتصال كتابيًا.
المادة 55: -أحكام عامة
مع مراعاة أي اتفاقيات إضافية، تشكل الشروط الاتفاقية الكاملة بينك وبين ahlanwashlan.com فيما يتعلق باستخدامك للمواقع والخدمات وتحكمها، وتحل محل أي اتفاقيات مكتوبة أو شفوية سابقة فيما يتعلق بالموضوع نفسه هنا.
Ahlanwashlan.com وأنت متعاقدان مستقلان ، ولا توجد علاقة بين وكالة أو شراكة أو مشروع مشترك أو صاحب عمل أو صاحب امتياز أو علاقة مانح الامتياز.
إذا تم اعتبار أي بند من البنود غير صالح أو غير قابل للتنفيذ، فسيتم حذف هذا الحكم وتظل الأحكام المتبقية سارية المفعول ويتم فرضها.
العناوين هي للأغراض المرجعية فقط ولا تحدد بأي حال من الأحوال أو تقيد أو تفسر أو تصف نطاق أو مدى هذا البند.
إن فشل ahlanwashlan.com في إنفاذ أي حق أو فشل في التصرف فيما يتعلق بأي انتهاك من جانبك بموجب الشروط لن يشكل تنازلاً عن هذا الحق أو تنازلاً عن حق ahlanwashlan.com في التصرف فيما يتعلق بالانتهاكات اللاحقة أو المماثلة.
يحق لشركة ahlanwashlan.com تعيين الشروط (بما في ذلك جميع حقوقنا وألقابنا ومزايانا ومصالحنا والتزاماتنا وواجباتنا في الشروط إلى أي شخص أو كيان. لا يجوز لك تعيين الشروط، كليًا أو جزئيًا، لأي شخص أو كيان.
 إذا كان لديك أي تعليقات على الخدمات التي نقدمها لك، فيمكنك الاتصال بخط دعم خدمة العملاء
المادة 56: -حل المنازعات
في حال النزاع يتم حل الخلاف عن طريق التوفيق والمفاوضات أو التسوية الودية أو التحكيم وذلك في المركز السعودي للتحكيم التجاري ووفقاً لقواعد المركز.
المادة 57: -اجراءات التحكيم وقواعدها
أي نزاع أو صراع أو مطالبة أو خلاف ينشأ عن ahlanwashlan.com أو يتعلق بها شكل كبير، أو عن هذه الاتفاقية أو فيما يتعلق بها، بما في ذلك تلك النزاعات المتعلقة بصلاحية هذه الاتفاقية أو تفسيرها أو قابليتها للتنفيذ (أي "خلاف") يجب أن يحال أولًا إلى إجراءات الوساطة بموجب قواعد الوساطة السارية في المركز السعودي للتحكيم التجاري ("قواعد الوساطة في المركز السعودي للتحكيم التجاري").
وفي حال عدم تسوية مثل هذا النزاع خلال ستين (60) يومًا بعد تقديم طلب الوساطة بموجب قواعد الوساطة الخاصة المركز السعودي للتحكيم التجاري، يمكن الإشارة إلى مثل هذه النزاعات ويتم حلها بصورة حصرية ونهائية عن طريق التحكيم بموجب قواعد التحكيم الخاصة بمركز. المركز السعودي للتحكيم التجاري ("قواعد التحكيم في المركز السعودي للتحكيم التجاري"). وينبغي حل النزاع بواسطة محكم واحد (1) يتم تعيينه وفقًا لقواعد المركز السعودي للتحكيم التجاري
يكون مكان الوساطة والتحكيم في المدينة التي يقع فيها المقر الرئيسي للشركة. وتكون لغة الوساطة و/أو التحكيم باللغة العربية، إلا إذا كنت لا تتحدث العربية، وفي هذه الحالة تكون وقائع الوساطة و/أو التحكيم باللغتين الإنجليزية واللغة العربية.
المادة 58: -القانون والتشريع المُطبّق
اتفاقية الاستخدام هذه محكومة ومصاغة بحسب القوانين واللوائح والتشريعات المعمول بها والسارية في المملكة العربية السعودية.
المادة 59 –الجرائم المعلوماتية:
يلتزم التاجر بعدم مخالفة أي من أحكام القوانين المنظمة للجرائم المعلوماتية في المملكة العربية السعودية، وفي حال مخالفتهم لأحكام القوانين المنظمة للجرائم المعلوماتية في المملكة العربية السعودية، يتحمل المخالف المسئولية دون أدنى مسئوليه على ahlanwashlan.com، من جراء مخالفته للقوانين السارية، ول ahlanwashlan.com، دائماً الحق في اتخاذ ما تراه مناسباً، سواءً عن طريق ابلاغ السلطات الرسمية أو الاكتفاء بإغلاق الحساب أو إلغاء عضوية التاجر لدى المنصة.
ماده 60: -
فيما لم يرد بشأنه نص في هذه السياسة تطبق احكام سياسة الخصوصية
المادة 61: -أحكام عامة
لا يجوز لك التنازل عن حقوقك أو نقلها بموجب هذه الاتفاقية كليًّا أو جزئيًّا دون الحصول على موافقة خطية مسبقة من شركة اهلا وسهلا كما أنك ملزم بالموافقة على أنه يجوز لشركة اهلا وسهلا التنازل عن حقوقها والتزاماتها أو نقلها بموجب هذه الاتفاقية كليًّا أو جزئيًّا إلى الجهات التالية:
شركة فرعية أو تابعة؛ أو
أحد الجهات التي تستحوذ على حقوق الملكية لشركة اهلا وسهلا أو أعمالها أو أصولها
أحد الخلفاء عن طريق الدمج.
ولا يؤدي العقد المبرم بينك وبين ahlanwashlan.com أو استخدام ahlanwashlan.com إلى إنشاء أي مشروع مشترك أو شراكة أو علاقة توظيف أو وكالة بينك وبين ahlanwashlan.com أو أي سائق.
في حال اعتبار أي بند من أحكام هذه الاتفاقية غير قانوني أو غير صالح أو غير قابل للتنفيذ، سواء كليًّا أو جزئيًّا، بموجب أي قانون، فلا يعد هذا الحكم أو جزء منه، وفق الحدود التي لا يعتبر هذا الحكم أو جزء منه يشكل جزءًا من هذه الاتفاقية، دون أن تتأثر قانونية وسريان وقابلية تنفيذ الأحكام الأخرى الواردة في هذه الاتفاقية.
وفي هذه الحالة، يتعين على الأطراف استبدال الحكم غير القانوني أو غير الصالح أو غير الملزم أو جزء منه بحكم آخر أو جزء منه قانوني وصالح وملزم، على أن يكون لهذا الحكم الجديد تأثير مماثل إلى أقصى حد ممكن للحكم السابق غير القانوني أو غير الصالح أو غير القابل للتنفيذ أو جزء منه، في ضوء محتويات هذه الاتفاقية والغرض منها.
تشكل هذه الاتفاقية مجمل الاتفاق والتفاهم بين الأطراف فيما يتعلق بموضوعها، وتنسخ وتحل محل جميع الاتفاقيات أو التعهدات السابقة أو القائمة ذات الصلة بهذا الموضوع.

              ''',style: TextStyle(fontSize: 22), )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
